\u79fb\u52a8=\u004d\u006f\u0076\u0065
\u004c\u0069\u006e\u0075\u0078\u0050\u0074\u0079\u0020\u6d3e\u751f\u547d\u4ee4\u002d\u003e\u0025\u0073=\u004c\u0069\u006e\u0075\u0078\u0050\u0074\u0079\u0020\u0044\u0065\u0072\u0069\u0076\u0065\u0064\u0020\u0043\u006f\u006d\u006d\u0061\u006e\u0064\u0073\u002d\u003e\u0025\u0073
\u72b6\u6001=\u0053\u0074\u0061\u0074\u0075\u0073
\u6dfb\u52a0=\u0041\u0064\u0064
\u5b8c\u6210=\u0044\u006f\u006e\u0065
\u5220\u9664\u6210\u529f\u0021\u0020\u5b50\u7ec4\u4e0e\u6210\u5458\u5df2\u5168\u90e8\u5220\u9664=\u0044\u0065\u006c\u0065\u0074\u0069\u006f\u006e\u0020\u0073\u0075\u0063\u0063\u0065\u0073\u0073\u0066\u0075\u006c\u0021\u0020\u0041\u006c\u006c\u0020\u0073\u0075\u0062\u0067\u0072\u006f\u0075\u0070\u0073\u0020\u0061\u006e\u0064\u0020\u006d\u0065\u006d\u0062\u0065\u0072\u0073\u0020\u0068\u0061\u0076\u0065\u0020\u0062\u0065\u0065\u006e\u0020\u0064\u0065\u006c\u0065\u0074\u0065\u0064
\u9009\u62e9=\u0053\u0065\u006c\u0065\u0063\u0074
\u57fa\u7840\u914d\u7f6e=\u0042\u0061\u0073\u0069\u0063\u0020\u0043\u006f\u006e\u0066\u0069\u0067\u0075\u0072\u0061\u0074\u0069\u006f\u006e
\u662f\u5426\u5f00\u542f\u9519\u8bef\u91cd\u8bd5\u0020\u0020\u4e00\u822c\u7528\u5728\u8d1f\u8f7d\u5747\u8861=\u0057\u0068\u0065\u0074\u0068\u0065\u0072\u0020\u0074\u006f\u0020\u0065\u006e\u0061\u0062\u006c\u0065\u0020\u0065\u0072\u0072\u006f\u0072\u0020\u0072\u0065\u0074\u0072\u0069\u0065\u0073\u0020\u006f\u0072\u0020\u006e\u006f\u0074\u0020\u0047\u0065\u006e\u0065\u0072\u0061\u006c\u006c\u0079\u0020\u0075\u0073\u0065\u0064\u0020\u0066\u006f\u0072\u0020\u006c\u006f\u0061\u0064\u0020\u0062\u0061\u006c\u0061\u006e\u0063\u0069\u006e\u0067
\u6dfb\u52a0\u5185\u5b58\u0053\u0068\u0065\u006c\u006c=\u0041\u0064\u0064\u0020\u006d\u0065\u006d\u006f\u0072\u0079\u0020\u0073\u0068\u0065\u006c\u006c
\u786e\u5b9a\u5220\u9664\u7ec4\uff1a\u0025\u0073\u0020\u5e76\u5220\u9664\u6240\u6709\u7ec4\u6210\u5458\u0028\u5305\u62ec\u5b50\u7ec4\u0029\u5417\u003f=\u004d\u0061\u006b\u0065\u0020\u0073\u0075\u0072\u0065\u0020\u0074\u006f\u0020\u0064\u0065\u006c\u0065\u0074\u0065\u0020\u0074\u0068\u0065\u0020\u0067\u0072\u006f\u0075\u0070\u003a\u0020\u0025\u0073\u0020\u0061\u006e\u0064\u0020\u0064\u0065\u006c\u0065\u0074\u0065\u0020\u0061\u006c\u006c\u0020\u0067\u0072\u006f\u0075\u0070\u0020\u006d\u0065\u006d\u0062\u0065\u0072\u0073\u0020\u0028\u0069\u006e\u0063\u006c\u0075\u0064\u0069\u006e\u0067\u0020\u0073\u0075\u0062\u0067\u0072\u006f\u0075\u0070\u0073\u0029\u003f
\u8bf7\u6c42\u53c2\u6570\u914d\u7f6e\u003a=\u0052\u0065\u0071\u0075\u0065\u0073\u0074\u0020\u0070\u0061\u0072\u0061\u006d\u0065\u0074\u0065\u0072\u0020\u0063\u006f\u006e\u0066\u0069\u0067\u0075\u0072\u0061\u0074\u0069\u006f\u006e\u003a
\u4fee\u6539\u5931\u8d25\u0021=\u0046\u0061\u0069\u006c\u0065\u0064\u0020\u0074\u006f\u0020\u006d\u006f\u0064\u0069\u0066\u0079\u0021
\u4fdd\u5b58\u66f4\u65b0=\u0053\u0061\u0076\u0065\u0020\u0075\u0070\u0064\u0061\u0074\u0065
\u8d85\u7ea7\u7ec8\u7aef=\u0048\u0079\u0070\u0065\u0072\u0054\u0065\u0072\u006d\u0069\u006e\u0061\u006c
\u8bf7\u6c42\u534f\u8bae\u5934\u0020\u652f\u6301\u0043\u0032\u4fe1\u9053=\u0052\u0065\u0071\u0075\u0065\u0073\u0074\u0020\u0070\u0072\u006f\u0074\u006f\u0063\u006f\u006c\u0020\u0068\u0065\u0061\u0064\u0065\u0072\u0020\u0053\u0075\u0070\u0070\u006f\u0072\u0074\u0020\u0066\u006f\u0072\u0020\u0043\u0032\u0020\u0063\u0068\u0061\u006e\u006e\u0065\u006c\u0073
\u538b\u7f29\u6587\u4ef6=\u0043\u006f\u006d\u0070\u0072\u0065\u0073\u0073\u0065\u0064\u0020\u0066\u0069\u006c\u0065
\u0043\u006c\u0061\u0073\u0073\u004e\u0061\u006d\u0065\u0020\u5c11\u4e8e\u0035\u0030\u4e2a=\u0043\u006c\u0061\u0073\u0073\u004e\u0061\u006d\u0065\u0020\u004c\u0065\u0073\u0073\u0020\u0074\u0068\u0061\u006e\u0020\u0035\u0030
\u0061\u0064\u0064\u0072\u0065\u0073\u0073\u003a\u0025\u0073\u0020\u0070\u006f\u0072\u0074\u003a\u0025\u0073\u0020\u4e0d\u652f\u6301\u7684\u5730\u5740\u7c7b\u578b\u003a\u0020\u0025\u0064=\u0061\u0064\u0064\u0072\u0065\u0073\u0073\u003a\u0025\u0073\u0020\u0070\u006f\u0072\u0074\u003a\u0025\u0073\u0020\u0055\u006e\u0073\u0075\u0070\u0070\u006f\u0072\u0074\u0065\u0064\u0020\u0061\u0064\u0064\u0072\u0065\u0073\u0073\u0020\u0074\u0079\u0070\u0065\u0073\u003a\u0020\u0025\u0064
\u8fde\u63a5\u8d85\u65f6=\u0043\u006f\u006e\u006e\u0065\u0063\u0074\u0069\u006f\u006e\u0020\u0074\u0069\u006d\u0065\u006f\u0075\u0074
\u4fe1\u9053\u5728\u8bf7\u6c42\u0042\u006f\u0064\u0079\u5185\u0020\u4f46\u0065\u006e\u0061\u0062\u006c\u0065\u0064\u0052\u0065\u0071\u0075\u0065\u0073\u0074\u0042\u006f\u0064\u0079\u5e76\u672a\u5f00\u542f=\u0043\u0068\u0061\u006e\u006e\u0065\u006c\u0020\u0069\u0073\u0020\u0069\u006e\u0020\u0072\u0065\u0071\u0075\u0065\u0073\u0074\u0042\u006f\u0064\u0079\u0020\u0062\u0075\u0074\u0020\u0065\u006e\u0061\u0062\u006c\u0065\u0064\u0052\u0065\u0071\u0075\u0065\u0073\u0074\u0042\u006f\u0064\u0079\u0020\u0069\u0073\u0020\u006e\u006f\u0074\u0020\u0065\u006e\u0061\u0062\u006c\u0065\u0064
\u0053\u0051\u004c\u8bed\u53e5\u662f\u7a7a\u7684=\u0053\u0051\u004c\u0020\u0073\u0074\u0061\u0074\u0065\u006d\u0065\u006e\u0074\u0020\u0069\u0073\u0020\u0065\u006d\u0070\u0074\u0079
\u590d\u5236\u6210\u529f\u0020\u0020\u0025\u0073\u0020\u003c\u003c\u003e\u003e\u0020\u0025\u0073=\u0043\u006f\u0070\u0079\u0020\u0073\u0075\u0063\u0063\u0065\u0073\u0073\u0020\u0025\u0073\u0020\u003c\u003c\u003e\u003e\u0020\u0025\u0073
\u6700\u5927\u9519\u8bef\u5c1d\u8bd5\u6b21\u6570\u003a\u0025\u0064\u0020\u9519\u8bef\u5c1d\u8bd5\u540e\u670d\u52a1\u5668\u4f9d\u7136\u65e0\u6cd5\u901a\u4fe1\u0020\u5df2\u5f3a\u5236\u5173\u95ed\u0068\u0074\u0074\u0070\u0054\u006f\u0053\u006f\u0063\u006b\u0073=\u004d\u0061\u0078\u0069\u006d\u0075\u006d\u0020\u006e\u0075\u006d\u0062\u0065\u0072\u0020\u006f\u0066\u0020\u0065\u0072\u0072\u006f\u0072\u0020\u0061\u0074\u0074\u0065\u006d\u0070\u0074\u0073\u003a\u0020\u0025\u0064\u0020\u0053\u0065\u0072\u0076\u0065\u0072\u0020\u0073\u0074\u0069\u006c\u006c\u0020\u0075\u006e\u0061\u0062\u006c\u0065\u0020\u0074\u006f\u0020\u0063\u006f\u006d\u006d\u0075\u006e\u0069\u0063\u0061\u0074\u0065\u0020\u0061\u0066\u0074\u0065\u0072\u0020\u0065\u0072\u0072\u006f\u0072\u0020\u0061\u0074\u0074\u0065\u006d\u0070\u0074\u0073\u0020\u0046\u006f\u0072\u0063\u0065\u0064\u0020\u0074\u006f\u0020\u0064\u0069\u0073\u0061\u0062\u006c\u0065\u0020\u0068\u0074\u0074\u0070\u0054\u006f\u0053\u006f\u0063\u006b\u0073
\u9009\u4e2d\u5217\u662f\u7a7a\u7684=\u0053\u0065\u006c\u0065\u0063\u0074\u0065\u0064\u0020\u0063\u006f\u006c\u0075\u006d\u006e\u0020\u0069\u0073\u0020\u0065\u006d\u0070\u0074\u0079
\u5df2\u6709\u0073\u0068\u0065\u006c\u006c\u0068\u006f\u0073\u0074\u0020\u0061\u0067\u0065\u006e\u0074\u0020\u65e0\u9700\u518d\u6b21\u4e0a\u4f20=\u0053\u0068\u0065\u006c\u006c\u0068\u006f\u0073\u0074\u0020\u0061\u0067\u0065\u006e\u0074\u0020\u0061\u006c\u0072\u0065\u0061\u0064\u0079\u0020\u0065\u0078\u0069\u0073\u0074\u0073\u002c\u0020\u006e\u006f\u0020\u006e\u0065\u0065\u0064\u0020\u0074\u006f\u0020\u0075\u0070\u006c\u006f\u0061\u0064\u0020\u0061\u0067\u0061\u0069\u006e
\u8bf7\u6c42\u4e2d\u95f4\u6570\u636e\u0020\u652f\u6301\u0043\u0032\u4fe1\u9053=\u0052\u0065\u0071\u0075\u0065\u0073\u0074\u0020\u0069\u006e\u0074\u0065\u0072\u006d\u0065\u0064\u0069\u0061\u0074\u0065\u0020\u0064\u0061\u0074\u0061\u0020\u0053\u0075\u0070\u0070\u006f\u0072\u0074\u0020\u0043\u0032\u0020\u0063\u0068\u0061\u006e\u006e\u0065\u006c
\u5927\u6587\u4ef6\u914d\u7f6e=\u004c\u0061\u0072\u0067\u0065\u0020\u0066\u0069\u006c\u0065\u0020\u0063\u006f\u006e\u0066\u0069\u0067\u0075\u0072\u0061\u0074\u0069\u006f\u006e
\u5171\u6709\u0025\u0064\u7ec4\u0020\u6240\u6709\u6210\u5458\u6570\u003a\u0025\u0064\u0020\u5f53\u524d\u7ec4\u662f\u003a\u0025\u0073\u0020\u5f53\u524d\u7ec4\u6210\u5458\u6570\u003a\u0025\u0064=\u0054\u006f\u0074\u0061\u006c\u0020\u0025\u0064\u0020\u0067\u0072\u006f\u0075\u0070\u0073\u0020\u0041\u006c\u006c\u0020\u006d\u0065\u006d\u0062\u0065\u0072\u0073\u003a\u0025\u0064\u0020\u0043\u0075\u0072\u0072\u0065\u006e\u0074\u0020\u0067\u0072\u006f\u0075\u0070\u0020\u0069\u0073\u003a\u0025\u0073\u0020\u0043\u0075\u0072\u0072\u0065\u006e\u0074\u0020\u0067\u0072\u006f\u0075\u0070\u0020\u006d\u0065\u006d\u0062\u0065\u0072\u0073\u003a\u0025\u0064
\u6587\u4ef6\u7ba1\u7406=\u0046\u0069\u006c\u0065\u0020\u006d\u0061\u006e\u0061\u0067\u0065\u006d\u0065\u006e\u0074
\u7a0b\u5e8f\u914d\u7f6e=\u0050\u0072\u006f\u0067\u0072\u0061\u006d\u0020\u0063\u006f\u006e\u0066\u0069\u0067\u0075\u0072\u0061\u0074\u0069\u006f\u006e
\u53f3\u8fb9\u8ffd\u52a0\u6570\u636e=\u0052\u0069\u0067\u0068\u0074\u0020\u0061\u0070\u0070\u0065\u006e\u0064\u0020\u0064\u0061\u0074\u0061
\u8d85\u7ea7\u670d\u52a1=\u0053\u0075\u0070\u0065\u0072\u0020\u0053\u0065\u0072\u0076\u0069\u0063\u0065
\u5df2\u542f\u52a8\u0021=\u0053\u0074\u0061\u0072\u0074\u0065\u0064\u0021
\u5220\u9664=\u0044\u0065\u006c\u0065\u0074\u0065
\u7528\u6237\u53d6\u6d88\u9009\u62e9\u002e\u002e\u002e\u002e=\u0055\u0073\u0065\u0072\u0020\u0064\u0065\u0073\u0065\u006c\u0065\u0063\u0074\u0065\u0064\u0020\u002e\u002e\u002e\u002e
\u4e0a\u4f20\u0050\u0074\u0079\u004f\u0066\u0043\u006f\u006e\u0073\u006f\u006c\u0065\u6210\u529f\u0021=\u0055\u0070\u006c\u006f\u0061\u0064\u0020\u006f\u0066\u0020\u0050\u0074\u0079\u004f\u0066\u0043\u006f\u006e\u0073\u006f\u006c\u0065\u0020\u0073\u0075\u0063\u0063\u0065\u0073\u0073\u0066\u0075\u006c\u0021
\u8bf7\u6c42\u5de6\u8fb9\u8ffd\u52a0\u6570\u636e=\u0052\u0065\u0071\u0075\u0065\u0073\u0074\u0020\u0074\u006f\u0020\u0061\u0070\u0070\u0065\u006e\u0064\u0020\u0064\u0061\u0074\u0061\u0020\u006f\u006e\u0020\u0074\u0068\u0065\u0020\u006c\u0065\u0066\u0074
\u4e0b\u8f7d\u6587\u4ef6\u5931\u8d25=\u0046\u0061\u0069\u006c\u0065\u0064\u0020\u0074\u006f\u0020\u0064\u006f\u0077\u006e\u006c\u006f\u0061\u0064\u0020\u0066\u0069\u006c\u0065
\u4ee3\u7406\u8bc1\u4e66\u914d\u7f6e=\u0041\u0067\u0065\u006e\u0074\u0020\u0063\u0065\u0072\u0074\u0069\u0066\u0069\u0063\u0061\u0074\u0065\u0020\u0063\u006f\u006e\u0066\u0069\u0067\u0075\u0072\u0061\u0074\u0069\u006f\u006e
\u5df2\u6709\u0077\u0069\u006e\u0070\u0074\u0079\u0020\u0061\u0067\u0065\u006e\u0074\u0020\u65e0\u9700\u518d\u6b21\u4e0a\u4f20=\u004e\u006f\u0020\u006e\u0065\u0065\u0064\u0020\u0074\u006f\u0020\u0075\u0070\u006c\u006f\u0061\u0064\u0020\u0061\u0067\u0061\u0069\u006e\u0020\u0077\u0068\u0065\u006e\u0020\u0079\u006f\u0075\u0020\u0061\u006c\u0072\u0065\u0061\u0064\u0079\u0020\u0068\u0061\u0076\u0065\u0020\u0061\u0020\u0077\u0069\u006e\u0070\u0074\u0079\u0020\u0061\u0067\u0065\u006e\u0074
\u0048\u0061\u0063\u006b\u0065\u0072\u6280\u672f\u5b66\u7684\u518d\u597d\u002c\u0020\u5374\u65e0\u6cd5\u5165\u4fb5\u4f60\u7684\u5fc3\u002c\u005c\u006e\u670d\u52a1\u5668\u5165\u4fb5\u7684\u518d\u591a\u002c\u5bf9\u4f60\u53ea\u6709\u0047\u0075\u0065\u0073\u0074\u002c\u005c\u006e\u662f\u6211\u7684\u0044\u0044\u004f\u0053\u9020\u6210\u4e86\u4f60\u7684\u62d2\u7edd\u670d\u52a1\uff1f\u005c\u006e\u8fd8\u662f\u6211\u7684\u0057\u0065\u0062\u0053\u0068\u0065\u006c\u006c\u518d\u6b21\u88ab\u4f60\u67e5\u6740\uff1f\u005c\u006e\u4f60\u603b\u6709\u9632\u706b\u5899\u005c\u006e\u6211\u59cb\u7ec8\u505c\u4e0d\u6389\u005c\u006e\u60f3\u63d0\u6743\u005c\u006e\u65e0\u5948\u004a\u0053\u0050\u002b\u004d\u0059\u0053\u0051\u004c\u6210\u4e3a\u6211\u4eec\u7684\u969c\u788d\u005c\u006e\u627e\u4e0d\u5230\u4f60\u7684\u6ce8\u5165\u70b9\u005c\u006e\u626b\u4e0d\u51fa\u4f60\u7684\u7a7a\u53e3\u4ee4\u005c\u006e\u6240\u6709\u5bf9\u6211\u7684\u56de\u5e94\u90fd\u7528\u0033\u0044\u0045\u0053\u52a0\u5bc6\u005c\u006e\u4f60\u603b\u662f\u81ea\u5b9a\u4e49\u6587\u4ef6\u683c\u5f0f\u005c\u006e\u6211\u6c38\u8fdc\u627e\u4e0d\u5230\u4f60\u7684\u5165\u53e3\u70b9\u005c\u006e\u5ffd\u7565\u6240\u6709\u5f02\u5e38\u005c\u006e\u5374\u8fd8\u662f\u8ddf\u8e2a\u4e0d\u5230\u4f60\u7684\u6ce8\u518c\u7801\u005c\u006e\u662f\u4f60\u592a\u8fc7\u5b8c\u7f8e\u002c\u8fd8\u662f\u6211\u592a\u83dc\u003f\u005c\u006e\u867d\u7136\u6211\u4eec\u662f\u4e0d\u540c\u7684\u5bf9\u8c61\u002c\u90fd\u6709\u9690\u79c1\u7684\u4e00\u9762\u002c\u005c\u006e\u4f46\u6211\u76f8\u4fe1\u603b\u6709\u4e00\u5929\u6211\u4f1a\u627e\u5230\u4f60\u7684\u63a5\u53e3\u002c\u628a\u6211\u7684\u6700\u771f\u7ed9\u4f60\u770b\u0021\u005c\u006e\u56e0\u4e3a\u6211\u662f\u4f60\u7684\u6307\u9488\u002c\u5728\u832b\u832b\u5185\u5b58\u7684\u5806\u6808\u4e2d\u002c\u0020\u6c38\u8fdc\u6307\u5411\u4f60\u90a3\u7247\u5929\u7a7a\u002c\u4e0d\u5b5c\u4e0d\u5026\u0021\u005c\u006e\u6211\u613f\u505a\u4f60\u7684\u5185\u8054\u002c\u4f9b\u4f60\u65e0\u9650\u6b21\u7684\u8c03\u7528\u002c\u76f4\u5230\u6d77\u67af\u77f3\u70c2\u0021\u005c\u006e\u6211\u613f\u505a\u4f60\u7684\u5f15\u7528\u002c\u548c\u4f60\u540c\u8fdb\u9000\u5171\u751f\u6b7b\u002c\u4e00\u8d77\u7ecf\u53d7\u8003\u9a8c\u0021\u005c\u006e\u53ea\u662f\u6211\u4e0d\u613f\u82e6\u82e6\u5730\u8c03\u8bd5\u4f60\u7684\u5fc3\u60c5\u002c\u6700\u7ec8\u6ca6\u4e3a\u4f60\u7684\u53cb\u5143\u0021\u005c\u006e\u5982\u4eca\u6211\u4eec\u5df2\u88ab\u004d\u0046\u0043\u5c01\u88c5\u002d\u002d\u4e8b\u4e8b\u53d8\u8fc1\u0021\u005c\u006e\u5982\u4eca\u6211\u4eec\u5df2\u5411\u0043\u004f\u004d\u8d70\u53bb\u002d\u002d\u53ef\u60f3\u5f53\u5e74\u0021\u005c\u006e\u6ca1\u4efb\u4f55\u5962\u6c42\u002c\u53ea\u613f\u505a\u4f60\u6700\u540e\u7684\u0053\u0079\u0073\u0074\u0065\u006d\u0021\u005c\u006e\u6e17\u900f\u73a9\u7684\u518d\u5f3a\u002c\u6211\u4e5f\u4e0d\u80fd\u63d0\u6743\u8fdb\u4f60\u7684\u5fc3\u005c\u006e\u514d\u6740\u73a9\u7684\u518d\u72e0\u002c\u6211\u4e5f\u8fc7\u4e0d\u4e86\u4f60\u7684\u4e3b\u9632\u5fa1\u005c\u006e\u5916\u6302\u5199\u7684\u518d\u53fc\u002c\u6211\u4e5f\u4e0d\u80fd\u64cd\u63a7\u4f60\u5bf9\u6211\u7684\u7231\u005c\u006e\u7f16\u7a0b\u73a9\u7684\u518d\u597d\u002c\u6211\u4e5f\u4e0d\u80fd\u5199\u51fa\u5b8c\u7f8e\u7684\u7231\u60c5\u005c\u006e\u7eb5\u4f7f\u6211\u591a\u4e48\u7684\u4e0d\u53ef\u4e00\u4e16\u002c\u4e5f\u4e0d\u662f\u4f60\u7684\u0053\u0079\u0073\u0074\u0065\u006d\u005c\u006e\u63d0\u6743\u4e86\u518d\u591a\u7684\u670d\u52a1\u5668\uff0c\u5374\u6c38\u8fdc\u6210\u4e0d\u4e86\u4f60\u7684\u0052\u006f\u006f\u0074\u005c\u006e\u002a\u002a\u0042\u0075\u0074\u002e\u002e\u002e\u002e\u002e\u002e\u0020\u002a\u002a\u005c\u006e\u90a3\u6015\u4f60\u7684\u5fc3\u518d\u5f3a\u5927\uff0c\u6211\u6709\u0030\u0064\u0061\u0079\u5728\u624b\u005c\u006e\u4e3b\u52a8\u9632\u5fa1\u518d\u725b\uff0c\u6211\u6709\u0052\u0030\u005c\u006e\u51fb\u8d25\u4f60\u53ea\u662f\u65f6\u95f4\u95ee\u9898\u002c\u0020\u5c31\u7b97\u80fd\u64cd\u63a7\uff0c\u4f60\u7684\u5fc3\u65e9\u5df2\u7ecf\u4e0d\u5c5e\u4e8e\u6211\u005c\u006e\u5df2\u88ab\u5343\u4eba\u0044\u006f\u0077\u006e\u004c\u006f\u0061\u0064\u005c\u006e\u5b8c\u7f8e\u7684\u7231\u60c5\u5199\u51fa\u6765\u80fd\u600e\u6837\uff0c\u7ec8\u7a76\u4f1a\u50cf\u6e38\u620f\u4e00\u6837\u7ed3\u675f\u005c\u006e\u4e0d\u662f\u4f60\u7684\u0053\u0079\u0073\u0074\u0065\u006d\u4e5f\u7f62\uff0c\u4f46\u6211\u6709\u0047\u0075\u0065\u0073\u0074\u7528\u6237\uff0c\u65e9\u665a\u63d0\u6743\u8fdb\u5165\u4f60\u7684\u7ba1\u7406\u5458\u7ec4\u005c\u006e\u005c\u006e\u4e5f\u8bb8\uff0c\u50cf\u4f60\u8bf4\u7684\u90a3\u6837\uff0c\u6211\u4eec\u662f\u4e0d\u540c\u4e16\u754c\u7684\u4eba\uff0c\u56e0\u4e3a\u6211\u662f\u4e5e\u4e10\u800c\u4e0d\u662f\u9a91\u58eb\u005c\u006e\u4eba\u53d8\u4e86\uff0c\u662f\u56e0\u4e3a\u5fc3\u8ddf\u7740\u751f\u6d3b\u5728\u53d8\u005c\u006e\u4eba\u751f\u6709\u68a6\uff0c\u5404\u81ea\u7cbe\u5f69\u005c\u006e\u71d5\u96c0\u5b89\u77e5\u9e3f\u9e44\u4e4b\u5fd7\u0021=\u004e\u006f\u0020\u006d\u0061\u0074\u0074\u0065\u0072\u0020\u0068\u006f\u0077\u0020\u0067\u006f\u006f\u0064\u0020\u0061\u0020\u0068\u0061\u0063\u006b\u0065\u0072\u0020\u0069\u0073\u002c\u0020\u0068\u0065\u0020\u0063\u0061\u006e\u0027\u0074\u0020\u0069\u006e\u0076\u0061\u0064\u0065\u0020\u0079\u006f\u0075\u0072\u0020\u0068\u0065\u0061\u0072\u0074\u002c\u0020\u006e\u006f\u0020\u006d\u0061\u0074\u0074\u0065\u0072\u0020\u0068\u006f\u0077\u0020\u006d\u0075\u0063\u0068\u0020\u0068\u0065\u0020\u0069\u006e\u0076\u0061\u0064\u0065\u0073\u0020\u0079\u006f\u0075\u0072\u0020\u0073\u0065\u0072\u0076\u0065\u0072\u002c\u0020\u0068\u0065\u0020\u006f\u006e\u006c\u0079\u0020\u0068\u0061\u0073\u0020\u0047\u0075\u0065\u0073\u0074\u002c\u0020\u0069\u0073\u0020\u006d\u0079\u0020\u0044\u0044\u004f\u0053\u0020\u0063\u0061\u0075\u0073\u0069\u006e\u0067\u0020\u0079\u006f\u0075\u0072\u0020\u0064\u0065\u006e\u0069\u0061\u006c\u0020\u006f\u0066\u0020\u0073\u0065\u0072\u0076\u0069\u0063\u0065\u003f\u0020\u005c\u004f\u0072\u0020\u0069\u0073\u0020\u0069\u0074\u0020\u006d\u0079\u0020\u0057\u0065\u0062\u0053\u0068\u0065\u006c\u006c\u0020\u0074\u0068\u0061\u0074\u0020\u0079\u006f\u0075\u0027\u0076\u0065\u0020\u006b\u0069\u006c\u006c\u0065\u0064\u0020\u0061\u0067\u0061\u0069\u006e\u003f\u0020\u005c\u006e\u0059\u006f\u0075\u0020\u0061\u006c\u0077\u0061\u0079\u0073\u0020\u0068\u0061\u0076\u0065\u0020\u0061\u0020\u0066\u0069\u0072\u0065\u0077\u0061\u006c\u006c\u0020\u005c\u006e\u0049\u0020\u0063\u0061\u006e\u0027\u0074\u0020\u0073\u0074\u006f\u0070\u0020\u005c\u006e\u0049\u0020\u0077\u0061\u006e\u0074\u0020\u0074\u006f\u0020\u0072\u0061\u0069\u0073\u0065\u0020\u0070\u006f\u0077\u0065\u0072\u0020\u005c\u006e\u0062\u0075\u0074\u0020\u004a\u0053\u0050\u002b\u004d\u0059\u0053\u0051\u004c\u0020\u0069\u0073\u0020\u006f\u0075\u0072\u0020\u006f\u0062\u0073\u0074\u0061\u0063\u006c\u0065\u0020\u005c\u006e\u0049\u0020\u0063\u0061\u006e\u0027\u0074\u0020\u0066\u0069\u006e\u0064\u0020\u0079\u006f\u0075\u0072\u0020\u0069\u006e\u006a\u0065\u0063\u0074\u0069\u006f\u006e\u0020\u0070\u006f\u0069\u006e\u0074\u0020\u005c\u006e\u0049\u0020\u0063\u0061\u006e\u0027\u0074\u0020\u0073\u0063\u0061\u006e\u0020\u0079\u006f\u0075\u0072\u0020\u0065\u006d\u0070\u0074\u0079\u0020\u0070\u0061\u0073\u0073\u0077\u006f\u0072\u0064\u0020\u005c\u006e\u0041\u006c\u006c\u0020\u0079\u006f\u0075\u0072\u0020\u0072\u0065\u0073\u0070\u006f\u006e\u0073\u0065\u0073\u0020\u0074\u006f\u0020\u006d\u0065\u0020\u0061\u0072\u0065\u0020\u0065\u006e\u0063\u0072\u0079\u0070\u0074\u0065\u0064\u0020\u0077\u0069\u0074\u0068\u0020\u0033\u0044\u0045\u0053\u0020\u005c\u006e\u0059\u006f\u0075\u0020\u0061\u006c\u0077\u0061\u0079\u0073\u0020\u0063\u0075\u0073\u0074\u006f\u006d\u0069\u007a\u0065\u0020\u0074\u0068\u0065\u0020\u0066\u0069\u006c\u0065\u0020\u0066\u006f\u0072\u006d\u0061\u0074\u0020\u005c\u006e\u0049\u0020\u0063\u0061\u006e\u0020\u006e\u0065\u0076\u0065\u0072\u0020\u0066\u0069\u006e\u0064\u0020\u0079\u006f\u0075\u0072\u0020\u0065\u006e\u0074\u0072\u0079\u0020\u0070\u006f\u0069\u006e\u0074\u0020\u005c\u006e\u0049\u0020\u0069\u0067\u006e\u006f\u0072\u0065\u0020\u0061\u006c\u006c\u0020\u0074\u0068\u0065\u0020\u0065\u0078\u0063\u0065\u0070\u0074\u0069\u006f\u006e\u0073\u0020\u005c\u006e\u0049\u0020\u0073\u0074\u0069\u006c\u006c\u0020\u0063\u0061\u006e\u0027\u0074\u0020\u0074\u0072\u0061\u0063\u0065\u0020\u0079\u006f\u0075\u0072\u0020\u0072\u0065\u0067\u0069\u0073\u0074\u0072\u0061\u0074\u0069\u006f\u006e\u0020\u0063\u006f\u0064\u0065\u0020\u005c\u006e\u0041\u0072\u0065\u0020\u0079\u006f\u0075\u0020\u0074\u006f\u006f\u0020\u0070\u0065\u0072\u0066\u0065\u0063\u0074\u002c\u0020\u006f\u0072\u0020\u0049\u0027\u006d\u0020\u006a\u0075\u0073\u0074\u0020\u0061\u0020\u006e\u006f\u006f\u0062\u003f\u0020\u005c\u0041\u006c\u0074\u0068\u006f\u0075\u0067\u0068\u0020\u0077\u0065\u0020\u0061\u0072\u0065\u0020\u0064\u0069\u0066\u0066\u0065\u0072\u0065\u006e\u0074\u0020\u006f\u0062\u006a\u0065\u0063\u0074\u0073\u0020\u0061\u006e\u0064\u0020\u0062\u006f\u0074\u0068\u0020\u0068\u0061\u0076\u0065\u0020\u0061\u0020\u0070\u0072\u0069\u0076\u0061\u0074\u0065\u0020\u0073\u0069\u0064\u0065\u002c\u005c\u006e\u0020\u0049\u0020\u0062\u0065\u006c\u0069\u0065\u0076\u0065\u0020\u0074\u0068\u0061\u0074\u0020\u006f\u006e\u0065\u0020\u0064\u0061\u0079\u0020\u0049\u0020\u0077\u0069\u006c\u006c\u0020\u0066\u0069\u006e\u0064\u0020\u0079\u006f\u0075\u0072\u0020\u0069\u006e\u0074\u0065\u0072\u0066\u0061\u0063\u0065\u0020\u0061\u006e\u0064\u0020\u0073\u0068\u006f\u0077\u0020\u0079\u006f\u0075\u0020\u006d\u0079\u0020\u0062\u0065\u0073\u0074\u0020\u0074\u0072\u0075\u0074\u0068\u0021\u0020\u005c\u0042\u0065\u0063\u0061\u0075\u0073\u0065\u0020\u0049\u0020\u0061\u006d\u0020\u0079\u006f\u0075\u0072\u0020\u0070\u006f\u0069\u006e\u0074\u0065\u0072\u002c\u0020\u0069\u006e\u0020\u0074\u0068\u0065\u0020\u0073\u0074\u0061\u0063\u006b\u0020\u006f\u0066\u0020\u006d\u0065\u006d\u006f\u0072\u0079\u002c\u0020\u0061\u006c\u0077\u0061\u0079\u0073\u0020\u0070\u006f\u0069\u006e\u0074\u0069\u006e\u0067\u0020\u0074\u006f\u0020\u0079\u006f\u0075\u0072\u0020\u0070\u0069\u0065\u0063\u0065\u0020\u006f\u0066\u0020\u0073\u006b\u0079\u002c\u0020\u0061\u006e\u0064\u0020\u006e\u0065\u0076\u0065\u0072\u0020\u0074\u0069\u0072\u0065\u0020\u006f\u0066\u0020\u0069\u0074\u0021\u0020\u005c\u0049\u0020\u0077\u0069\u006c\u006c\u0020\u0062\u0065\u0020\u0079\u006f\u0075\u0072\u0020\u0069\u006e\u006c\u0069\u006e\u0065\u002c\u0020\u0066\u006f\u0072\u0020\u0079\u006f\u0075\u0020\u0074\u006f\u0020\u0063\u0061\u006c\u006c\u0020\u0069\u006e\u0066\u0069\u006e\u0069\u0074\u0065\u006c\u0079\u002c\u0020\u0075\u006e\u0074\u0069\u006c\u0020\u0074\u0068\u0065\u0020\u0073\u0065\u0061\u0020\u0072\u0075\u006e\u0073\u0020\u0064\u0072\u0079\u0021\u0020\u005c\u0049\u0027\u0064\u0020\u006c\u0069\u006b\u0065\u0020\u0074\u006f\u0020\u0062\u0065\u0020\u0079\u006f\u0075\u0072\u0020\u0072\u0065\u0066\u0065\u0072\u0065\u006e\u0063\u0065\u002c\u0020\u0074\u006f\u0020\u006c\u0069\u0076\u0065\u0020\u0061\u006e\u0064\u0020\u0064\u0069\u0065\u0020\u0077\u0069\u0074\u0068\u0020\u0079\u006f\u0075\u002c\u0020\u0074\u006f\u0020\u0073\u0074\u0061\u006e\u0064\u0020\u0074\u0068\u0065\u0020\u0074\u0065\u0073\u0074\u0020\u0074\u006f\u0067\u0065\u0074\u0068\u0065\u0072\u0021\u0020\u005c\u0049\u0020\u006a\u0075\u0073\u0074\u0020\u0064\u006f\u006e\u0027\u0074\u0020\u0077\u0061\u006e\u0074\u0020\u0074\u006f\u0020\u0073\u0074\u0072\u0075\u0067\u0067\u006c\u0065\u0020\u0074\u006f\u0020\u0064\u0065\u0062\u0075\u0067\u0020\u0079\u006f\u0075\u0072\u0020\u006d\u006f\u006f\u0064\u0020\u0061\u006e\u0064\u0020\u0065\u006e\u0064\u0020\u0075\u0070\u0020\u0061\u0073\u0020\u0079\u006f\u0075\u0072\u0020\u0066\u0072\u0069\u0065\u006e\u0064\u0021\u0020\u005c\u006e\u004e\u006f\u0077\u0020\u0077\u0065\u0020\u0068\u0061\u0076\u0065\u0020\u0062\u0065\u0065\u006e\u0020\u0065\u006e\u0063\u0061\u0070\u0073\u0075\u006c\u0061\u0074\u0065\u0064\u0020\u0062\u0079\u0020\u004d\u0046\u0043\u0020\u002d\u0020\u0074\u0068\u0069\u006e\u0067\u0073\u0020\u0068\u0061\u0076\u0065\u0020\u0063\u0068\u0061\u006e\u0067\u0065\u0064\u0021\u0020\u005c\u004e\u006f\u0077\u0020\u0077\u0065\u0027\u0076\u0065\u0020\u0067\u006f\u006e\u0065\u0020\u0074\u006f\u0020\u0043\u004f\u004d\u0020\u002d\u0020\u0074\u0068\u0069\u006e\u006b\u0020\u006f\u0066\u0020\u0074\u0068\u0065\u0020\u0064\u0061\u0079\u0073\u0021\u0020\u005c\u006e\u004e\u006f\u0020\u0065\u0078\u0074\u0072\u0061\u0076\u0061\u0067\u0061\u006e\u0063\u0065\u002c\u0020\u0049\u0020\u006a\u0075\u0073\u0074\u0020\u0077\u0061\u006e\u0074\u0020\u0074\u006f\u0020\u0062\u0065\u0020\u0079\u006f\u0075\u0072\u0020\u006c\u0061\u0073\u0074\u0020\u0053\u0079\u0073\u0074\u0065\u006d\u0021\u0020\u005c\u006e\u004e\u006f\u0020\u006d\u0061\u0074\u0074\u0065\u0072\u0020\u0068\u006f\u0077\u0020\u0073\u0074\u0072\u006f\u006e\u0067\u0020\u0074\u0068\u0065\u0020\u0069\u006e\u0066\u0069\u006c\u0074\u0072\u0061\u0074\u0069\u006f\u006e\u0020\u0070\u006c\u0061\u0079\u0020\u0069\u0073\u002c\u0020\u0049\u0020\u0063\u0061\u006e\u0027\u0074\u0020\u006d\u0065\u006e\u0074\u0069\u006f\u006e\u0020\u0074\u0068\u0065\u0020\u0072\u0069\u0067\u0068\u0074\u0020\u0069\u006e\u0074\u006f\u0020\u0079\u006f\u0075\u0072\u0020\u0068\u0065\u0061\u0072\u0074\u0020\u005c\u006e\u004e\u006f\u0020\u006d\u0061\u0074\u0074\u0065\u0072\u0020\u0068\u006f\u0077\u0020\u0068\u0061\u0072\u0064\u0020\u0074\u0068\u0065\u0020\u006e\u006f\u002d\u006b\u0069\u006c\u006c\u0020\u0070\u006c\u0061\u0079\u0020\u0069\u0073\u002c\u0020\u0049\u0020\u0063\u0061\u006e\u0027\u0074\u0020\u0067\u0065\u0074\u0020\u0070\u0061\u0073\u0074\u0020\u0079\u006f\u0075\u0072\u0020\u006d\u0061\u0069\u006e\u0020\u0064\u0065\u0066\u0065\u006e\u0073\u0065\u0020\u005c\u006e\u004e\u006f\u0020\u006d\u0061\u0074\u0074\u0065\u0072\u0020\u0068\u006f\u0077\u0020\u0064\u0065\u006e\u0073\u0065\u0020\u0074\u0068\u0065\u0020\u0070\u006c\u0075\u0067\u002d\u0069\u006e\u0020\u0077\u0072\u0069\u0074\u0069\u006e\u0067\u0020\u0069\u0073\u002c\u0020\u0049\u0020\u0063\u0061\u006e\u0027\u0074\u0020\u006d\u0061\u006e\u0069\u0070\u0075\u006c\u0061\u0074\u0065\u0020\u0079\u006f\u0075\u0072\u0020\u006c\u006f\u0076\u0065\u0020\u0066\u006f\u0072\u0020\u006d\u0065\u0020\u005c\u006e\u004e\u006f\u0020\u006d\u0061\u0074\u0074\u0065\u0072\u0020\u0068\u006f\u0077\u0020\u0067\u006f\u006f\u0064\u0020\u0074\u0068\u0065\u0020\u0070\u0072\u006f\u0067\u0072\u0061\u006d\u006d\u0069\u006e\u0067\u0020\u0070\u006c\u0061\u0079\u0020\u0069\u0073\u002c\u0020\u0049\u0020\u0063\u0061\u006e\u0027\u0074\u0020\u0077\u0072\u0069\u0074\u0065\u0020\u0074\u0068\u0065\u0020\u0070\u0065\u0072\u0066\u0065\u0063\u0074\u0020\u006c\u006f\u0076\u0065\u0020\u005c\u006e\u004e\u006f\u0020\u006d\u0061\u0074\u0074\u0065\u0072\u0020\u0068\u006f\u0077\u0020\u0075\u006e\u0062\u0065\u0061\u0074\u0061\u0062\u006c\u0065\u0020\u0049\u0020\u0061\u006d\u002c\u0020\u0049\u0027\u006d\u0020\u006e\u006f\u0074\u0020\u0079\u006f\u0075\u0072\u0020\u0053\u0079\u0073\u0074\u0065\u006d\u0020\u005c\u006e\u004e\u006f\u0020\u006d\u0061\u0074\u0074\u0065\u0072\u0020\u0068\u006f\u0077\u0020\u006d\u0075\u0063\u0068\u0020\u0049\u0020\u006d\u0065\u006e\u0074\u0069\u006f\u006e\u0020\u0074\u0068\u0065\u0020\u0072\u0069\u0067\u0068\u0074\u0020\u0049\u0020\u0063\u0061\u006e\u0020\u006e\u0065\u0076\u0065\u0072\u0020\u0062\u0065\u0063\u006f\u006d\u0065\u0020\u0079\u006f\u0075\u0072\u0020\u0052\u006f\u006f\u0074\u002e\u002e\u002e\u0020\u002a\u002a\u0042\u0075\u0074\u002e\u002e\u002e\u002e\u002e\u002e\u0020\u002a\u002a\u005c\u0049\u0027\u0076\u0065\u0020\u0067\u006f\u0074\u0020\u0030\u0064\u0061\u0079\u0020\u0069\u006e\u0020\u006d\u0079\u0020\u0068\u0061\u006e\u0064\u002e\u002e\u002e\u0020\u0049\u0027\u0076\u0065\u0020\u0067\u006f\u0074\u0020\u0052\u0030\u002e\u002e\u002e\u0020\u0049\u0074\u0027\u0073\u0020\u006f\u006e\u006c\u0079\u0020\u0061\u0020\u006d\u0061\u0074\u0074\u0065\u0072\u0020\u006f\u0066\u0020\u0074\u0069\u006d\u0065\u0020\u0062\u0065\u0066\u006f\u0072\u0065\u0020\u0049\u0020\u0062\u0065\u0061\u0074\u0020\u0079\u006f\u0075\u002e\u002e\u002e\u0020\u0045\u0076\u0065\u006e\u0020\u0069\u0066\u0020\u0049\u0020\u0063\u0061\u006e\u0020\u0063\u006f\u006e\u0074\u0072\u006f\u006c\u0020\u0069\u0074\u002c\u0020\u0079\u006f\u0075\u0072\u0020\u0068\u0065\u0061\u0072\u0074\u0020\u0064\u006f\u0065\u0073\u006e\u0027\u0074\u0020\u0062\u0065\u006c\u006f\u006e\u0067\u0020\u0074\u006f\u0020\u006d\u0065\u002e\u002e\u002e\u0020\u0049\u0027\u0076\u0065\u0020\u0062\u0065\u0065\u006e\u0020\u0044\u006f\u0077\u006e\u004c\u006f\u0061\u0064\u0020\u0062\u0079\u0020\u0061\u0020\u0074\u0068\u006f\u0075\u0073\u0061\u006e\u0064\u0020\u0070\u0065\u006f\u0070\u006c\u0065\u002e\u002e\u002e\u0020\u0057\u0068\u0061\u0074\u0020\u0063\u0061\u006e\u0020\u0061\u0020\u0070\u0065\u0072\u0066\u0065\u0063\u0074\u0020\u006c\u006f\u0076\u0065\u0020\u0062\u0065\u0020\u0077\u0072\u0069\u0074\u0074\u0065\u006e\u003f\u0020\u0049\u0074\u0020\u0077\u0069\u006c\u006c\u0020\u0065\u006e\u0064\u0020\u0075\u0070\u0020\u006c\u0069\u006b\u0065\u0020\u0061\u0020\u0067\u0061\u006d\u0065\u002e\u002e\u002e\u0020\u0049\u0074\u0027\u0073\u0020\u006f\u006b\u0061\u0079\u0020\u0069\u0066\u0020\u0049\u0027\u006d\u0020\u006e\u006f\u0074\u0020\u0079\u006f\u0075\u0072\u0020\u0053\u0079\u0073\u0074\u0065\u006d\u002c\u0020\u0062\u0075\u0074\u0020\u0049\u0027\u0076\u0065\u0020\u0067\u006f\u0074\u0020\u0047\u0075\u0065\u0073\u0074\u0020\u0075\u0073\u0065\u0072\u0073\u002e\u002e\u002e\u0020\u0049\u0027\u006c\u006c\u0020\u0067\u0065\u0074\u0020\u0069\u0074\u0020\u0073\u006f\u006f\u006e\u0065\u0072\u0020\u006f\u0072\u0020\u006c\u0061\u0074\u0065\u0072\u002e\u0020\u0045\u006e\u0074\u0065\u0072\u0020\u0079\u006f\u0075\u0072\u0020\u0041\u0064\u006d\u0069\u006e\u0020\u0067\u0072\u006f\u0075\u0070\u005c\u006e\u005c\u006e\u004d\u0061\u0079\u0062\u0065\u002c\u0020\u006c\u0069\u006b\u0065\u0020\u0079\u006f\u0075\u0020\u0073\u0061\u0069\u0064\u002c\u0020\u0077\u0065\u0020\u0061\u0072\u0065\u0020\u0070\u0065\u006f\u0070\u006c\u0065\u0020\u006f\u0066\u0020\u0064\u0069\u0066\u0066\u0065\u0072\u0065\u006e\u0074\u0020\u0077\u006f\u0072\u006c\u0064\u0073\u0020\u0062\u0065\u0063\u0061\u0075\u0073\u0065\u0020\u0049\u0020\u0061\u006d\u0020\u0061\u0020\u0062\u0065\u0067\u0067\u0061\u0072\u0020\u0061\u006e\u0064\u0020\u006e\u006f\u0074\u0020\u0061\u0020\u006b\u006e\u0069\u0067\u0068\u0074\u005c\u006e\u0050\u0065\u006f\u0070\u006c\u0065\u0020\u0068\u0061\u0076\u0065\u0020\u0063\u0068\u0061\u006e\u0067\u0065\u0064\u0020\u0062\u0065\u0063\u0061\u0075\u0073\u0065\u0020\u0074\u0068\u0065\u0069\u0072\u0020\u0068\u0065\u0061\u0072\u0074\u0073\u0020\u0061\u0072\u0065\u0020\u0063\u0068\u0061\u006e\u0067\u0069\u006e\u0067\u0020\u0066\u006f\u006c\u006c\u006f\u0077\u0069\u006e\u0067\u0020\u006c\u0069\u0066\u0065\u005c\u006e\u004c\u0069\u0066\u0065\u0020\u0068\u0061\u0073\u0020\u0064\u0072\u0065\u0061\u006d\u0073\u002c\u0020\u0065\u0061\u0063\u0068\u0020\u0069\u0073\u0020\u0077\u006f\u006e\u0064\u0065\u0072\u0066\u0075\u006c\u005c\u006e\u0054\u0068\u0065\u0020\u0073\u0077\u0061\u006c\u006c\u006f\u0077\u0020\u006b\u006e\u006f\u0077\u0073\u0020\u0074\u0068\u0065\u0020\u0077\u0069\u006c\u006c\u0020\u006f\u0066\u0020\u0074\u0068\u0065\u0020\u0073\u0077\u0061\u006e\u0021
\u0057\u0069\u006e\u0050\u0074\u0079\u0020\u6d3e\u751f\u547d\u4ee4\u002d\u003e\u0025\u0073=\u0057\u0069\u006e\u0050\u0074\u0079\u0020\u0064\u0065\u0072\u0069\u0076\u0065\u0020\u0063\u006f\u006d\u006d\u0061\u006e\u0064\u002d\u003e\u0025\u0073
\u5220\u9664\u5f53\u524d\u7ec4\u5e76\u5220\u9664\u6240\u6709\u6210\u5458=\u0044\u0065\u006c\u0065\u0074\u0065\u0020\u0074\u0068\u0065\u0020\u0063\u0075\u0072\u0072\u0065\u006e\u0074\u0020\u0067\u0072\u006f\u0075\u0070\u0020\u0061\u006e\u0064\u0020\u0072\u0065\u006d\u006f\u0076\u0065\u0020\u0061\u006c\u006c\u0020\u006d\u0065\u006d\u0062\u0065\u0072\u0073
\u590d\u5236\u7edd\u5bf9\u8def\u5f84=\u0043\u006f\u0070\u0079\u0020\u0061\u0062\u0073\u006f\u006c\u0075\u0074\u0065\u0020\u0070\u0061\u0074\u0068
\u5f00\u542f\u7f13\u5b58=\u0054\u0075\u0072\u006e\u0020\u006f\u006e\u0020\u0063\u0061\u0063\u0068\u0065
\u60a8\u662f\u0053\u0059\u0053\u0054\u0045\u004d\u0021\u0020\u5df2\u5347\u7ea7\u5230\u9ad8\u7ea7\u6a21\u5f0f=\u0059\u006f\u0075\u0020\u0061\u0072\u0065\u0020\u0053\u0059\u0053\u0054\u0045\u004d\u0021\u0020\u0055\u0070\u0067\u0072\u0061\u0064\u0065\u0064\u0020\u0074\u006f\u0020\u0061\u0064\u0076\u0061\u006e\u0063\u0065\u0064\u0020\u006d\u006f\u0064\u0065
\u8fdb\u7a0b\u8be6\u60c5=\u0050\u0072\u006f\u0063\u0065\u0073\u0073\u0020\u0064\u0065\u0074\u0061\u0069\u006c\u0073
\u968f\u673a\u0052\u0065\u0071\u0050\u0061\u0072\u0061\u006d\u0065\u0074\u0065\u0072\u5927\u5c0f\u003a=\u0052\u0061\u006e\u0064\u006f\u006d\u0020\u0052\u0065\u0071\u0050\u0061\u0072\u0061\u006d\u0065\u0074\u0065\u0072\u0020\u0073\u0069\u007a\u0065\u003a
\u8fdc\u7a0b\u0053\u006f\u0063\u006b\u0073\u0020\u0055\u0052\u004c\u5730\u5740\u003a=\u0052\u0065\u006d\u006f\u0074\u0065\u0020\u0053\u006f\u0063\u006b\u0073\u0020\u0055\u0052\u004c\u0020\u0061\u0064\u0064\u0072\u0065\u0073\u0073\u003a
\u590d\u5236\u9009\u4e2d\u884c=\u0043\u006f\u0070\u0079\u0020\u0073\u0065\u006c\u0065\u0063\u0074\u0065\u0064\u0020\u006c\u0069\u006e\u0065
\u53d6\u6d88=\u0043\u0061\u006e\u0063\u0065\u006c
\u5df2\u5f00\u59cb\u5b58\u6d3b\u68c0\u6d4b=\u0053\u0075\u0072\u0076\u0069\u0076\u0061\u006c\u0020\u0064\u0065\u0074\u0065\u0063\u0074\u0069\u006f\u006e\u0020\u0068\u0061\u0073\u0020\u0062\u0065\u0065\u006e\u0020\u0073\u0074\u0061\u0072\u0074\u0065\u0064
\u9759\u6001\u53d8\u91cf=\u0053\u0074\u0061\u0074\u0069\u0063\u0020\u0056\u0061\u0072\u0069\u0061\u0062\u006c\u0065\u0073
\u0050\u0061\u0079\u006c\u006f\u0061\u0064\u914d\u7f6e=\u0050\u0061\u0079\u006c\u006f\u0061\u0064\u0020\u0063\u006f\u006e\u0066\u0069\u0067\u0075\u0072\u0061\u0074\u0069\u006f\u006e
\u8b66\u544a\u005c\u0074\u5f53\u524d\u7248\u672c\u003a\u0025\u0073=\u0057\u0061\u0072\u006e\u0069\u006e\u0067\u0020\u005c\u0074\u0020\u0063\u0075\u0072\u0072\u0065\u006e\u0074\u0020\u0076\u0065\u0072\u0073\u0069\u006f\u006e\u003a\u0025\u0073
\u7ba1\u7406=\u004d\u0061\u006e\u0061\u0067\u0065
\u6dfb\u52a0\u63d2\u4ef6\u5931\u8d25=\u0046\u0061\u0069\u006c\u0065\u0064\u0020\u0074\u006f\u0020\u0061\u0064\u0064\u0020\u0070\u006c\u0075\u0067\u0069\u006e
\u521d\u59cb\u5316\u0050\u0074\u0079\u5931\u8d25\u0021\u0021\u0021=\u0046\u0061\u0069\u006c\u0065\u0064\u0020\u0074\u006f\u0020\u0069\u006e\u0069\u0074\u0069\u0061\u006c\u0069\u007a\u0065\u0020\u0074\u0068\u0065\u0020\u0050\u0074\u0079\u0021\u0021\u0021
\u4ec5\u652f\u6301\u004c\u0069\u006e\u0075\u0078=\u004c\u0069\u006e\u0075\u0078\u0020\u0073\u0075\u0070\u0070\u006f\u0072\u0074\u0020\u006f\u006e\u006c\u0079
\u5df2\u53d6\u6d88=\u0043\u0061\u006e\u0063\u0065\u006c\u0065\u0064
\u547d\u4ee4\u6267\u884c=\u0043\u006f\u006d\u006d\u0061\u006e\u0064\u0020\u0065\u0078\u0065\u0063\u0075\u0074\u0069\u006f\u006e
\u8bf7\u8f93\u5165\u65b0\u7ec4\u540d=\u0050\u006c\u0065\u0061\u0073\u0065\u0020\u0065\u006e\u0074\u0065\u0072\u0020\u006e\u0065\u0077\u0020\u0067\u0072\u006f\u0075\u0070\u0020\u006e\u0061\u006d\u0065
\u8be6\u7ec6\u65e5\u5fd7\u003a=\u0044\u0065\u0074\u0061\u0069\u006c\u0065\u0064\u0020\u006c\u006f\u0067\u003a
\u5982\u679c\u4f60\u4e0d\u77e5\u9053\u8fd9\u4e2a\u529f\u80fd\u662f\u505a\u4ec0\u4e48\u7684\u8bf7\u4e0d\u8981\u70b9\u51fb\u0021\u0020\u8fd9\u53ef\u80fd\u4f1a\u5f15\u8d77\u62d2\u7edd\u670d\u52a1\u0021=\u0049\u0066\u0020\u0079\u006f\u0075\u0020\u0064\u006f\u006e\u0027\u0074\u0020\u006b\u006e\u006f\u0077\u0020\u0077\u0068\u0061\u0074\u0020\u0074\u0068\u0069\u0073\u0020\u0066\u0075\u006e\u0063\u0074\u0069\u006f\u006e\u0020\u0064\u006f\u0065\u0073\u0020\u0070\u006c\u0065\u0061\u0073\u0065\u0020\u0064\u006f\u006e\u0027\u0074\u0020\u0063\u006c\u0069\u0063\u006b\u0020\u006f\u006e\u0020\u0069\u0074\u0021\u0020\u0054\u0068\u0069\u0073\u0020\u006d\u0061\u0079\u0020\u0063\u0061\u0075\u0073\u0065\u0020\u0061\u0020\u0064\u0065\u006e\u0069\u0061\u006c\u0020\u006f\u0066\u0020\u0073\u0065\u0072\u0076\u0069\u0063\u0065\u0021
\u54cd\u5e94\u5de6\u8fb9\u8ffd\u52a0\u6570\u636e=\u0041\u0070\u0070\u0065\u006e\u0064\u0020\u0064\u0061\u0074\u0061\u0020\u0074\u006f\u0020\u0074\u0068\u0065\u0020\u006c\u0065\u0066\u0074\u0020\u006f\u0066\u0020\u0074\u0068\u0065\u0020\u0072\u0065\u0073\u0070\u006f\u006e\u0073\u0065
\u5927\u6587\u4ef6\u4e0b\u8f7d=\u004c\u0061\u0072\u0067\u0065\u0020\u0066\u0069\u006c\u0065\u0020\u0064\u006f\u0077\u006e\u006c\u006f\u0061\u0064
\u4fee\u6539\u6210\u529f\u0020\u914d\u7f6e\u5df2\u751f\u6548=\u004d\u006f\u0064\u0069\u0066\u0069\u0063\u0061\u0074\u0069\u006f\u006e\u0020\u0073\u0075\u0063\u0063\u0065\u0073\u0073\u0066\u0075\u006c\u0020\u0043\u006f\u006e\u0066\u0069\u0067\u0075\u0072\u0061\u0074\u0069\u006f\u006e\u0020\u006e\u006f\u0077\u0020\u0069\u006e\u0020\u0065\u0066\u0066\u0065\u0063\u0074
\u542f\u52a8\u5931\u8d25\u0021=\u0046\u0061\u0069\u006c\u0065\u0064\u0020\u0074\u006f\u0020\u0073\u0074\u0061\u0072\u0074\u0021
\u505c\u6b62\u4ee3\u7406=\u0053\u0074\u006f\u0070\u0020\u0061\u0067\u0065\u006e\u0074
\u5171\u0020\u0020\u0025\u0073\u0020\u004d\u0062=\u0054\u006f\u0074\u0061\u006c\u0020\u0025\u0073\u0020\u004d\u0062
\u901a\u4fe1\u65f6\u53d1\u751f\u9519\u8bef\u0020\u8bf7\u68c0\u67e5\u670d\u52a1\u662f\u5426\u542f\u52a8\u0020\u7f51\u7edc\u662f\u5426\u7545\u901a\u0020\u5bc6\u94a5\u662f\u5426\u6b63\u786e\u0021=\u0041\u006e\u0020\u0065\u0072\u0072\u006f\u0072\u0020\u006f\u0063\u0063\u0075\u0072\u0072\u0065\u0064\u0020\u0077\u0068\u0069\u006c\u0065\u0020\u0063\u006f\u006d\u006d\u0075\u006e\u0069\u0063\u0061\u0074\u0069\u006e\u0067\u0020\u0050\u006c\u0065\u0061\u0073\u0065\u0020\u0063\u0068\u0065\u0063\u006b\u0020\u0069\u0066\u0020\u0074\u0068\u0065\u0020\u0073\u0065\u0072\u0076\u0069\u0063\u0065\u0020\u0069\u0073\u0020\u0073\u0074\u0061\u0072\u0074\u0065\u0064\u0020\u0061\u006e\u0064\u0020\u0069\u0066\u0020\u0074\u0068\u0065\u0020\u006e\u0065\u0074\u0077\u006f\u0072\u006b\u0020\u0069\u0073\u0020\u0077\u006f\u0072\u006b\u0069\u006e\u0067\u0020\u0063\u006f\u0072\u0072\u0065\u0063\u0074\u006c\u0079\u0020\u004b\u0065\u0079\u0073\u0020\u0061\u0072\u0065\u0020\u0063\u006f\u0072\u0072\u0065\u0063\u0074\u0021
\u54cd\u5e94\u534f\u8bae\u5934\u0020\u652f\u6301\u0043\u0032\u4fe1\u9053=\u0052\u0065\u0073\u0070\u006f\u006e\u0073\u0065\u0020\u0070\u0072\u006f\u0074\u006f\u0063\u006f\u006c\u0020\u0068\u0065\u0061\u0064\u0065\u0072\u0020\u0043\u0032\u0020\u0063\u0068\u0061\u006e\u006e\u0065\u006c\u0020\u0073\u0075\u0070\u0070\u006f\u0072\u0074\u0065\u0064
\u672a\u627e\u5230\u004a\u0061\u0072\u4f4d\u7f6e\u005c\u0072\u005c\u006e\u4f60\u4f7f\u7528\u7684\u8f6f\u4ef6\u53ef\u80fd\u5df2\u88ab\u75c5\u6bd2\u611f\u67d3\u0020\u0020\u0020\u6587\u4ef6\u54c8\u5e0c\u6548\u9a8c\u5931\u8d25=\u004a\u0061\u0072\u0020\u006c\u006f\u0063\u0061\u0074\u0069\u006f\u006e\u0020\u006e\u006f\u0074\u0020\u0066\u006f\u0075\u006e\u0064\u0020\u005c\u0072\u005c\u006e\u0020\u0054\u0068\u0065\u0020\u0073\u006f\u0066\u0074\u0077\u0061\u0072\u0065\u0020\u0079\u006f\u0075\u0020\u0061\u0072\u0065\u0020\u0075\u0073\u0069\u006e\u0067\u0020\u006d\u0061\u0079\u0020\u0062\u0065\u0020\u0069\u006e\u0066\u0065\u0063\u0074\u0065\u0064\u0020\u0077\u0069\u0074\u0068\u0020\u0061\u0020\u0076\u0069\u0072\u0075\u0073\u0020\u0046\u0069\u006c\u0065\u0020\u0068\u0061\u0073\u0068\u0020\u0076\u0061\u006c\u0069\u0064\u0061\u0074\u0069\u006f\u006e\u0020\u0066\u0061\u0069\u006c\u0065\u0064
\u65b0\u5efa\u6587\u4ef6=\u004e\u0065\u0077\u0020\u0066\u0069\u006c\u0065\u0020\u0063\u0072\u0065\u0061\u0074\u0065\u0064
\u5df2\u505c\u6b62\u626b\u63cf\u0021=\u0053\u0063\u0061\u006e\u006e\u0069\u006e\u0067\u0020\u0068\u0061\u0073\u0020\u0062\u0065\u0065\u006e\u0020\u0073\u0074\u006f\u0070\u0070\u0065\u0064\u0021
\u5df2\u5b8c\u6210\u0020\u0020\u0025\u0073\u0020\u004d\u0062=\u0043\u006f\u006d\u0070\u006c\u0065\u0074\u0065\u0064\u0020\u0025\u0073\u0020\u004d\u0062
\u4ee3\u7406\u4e3b\u673a=\u0050\u0072\u006f\u0078\u0079\u0020\u0068\u006f\u0073\u0074
\u79fb\u52a8\u5931\u8d25\u0020\u8bf7\u68c0\u67e5\u65b0\u7ec4\u662f\u5426\u5b58\u5728\u0020\u63a7\u5236\u53f0\u662f\u5426\u6709\u62a5\u9519\u0021=\u004d\u006f\u0076\u0065\u0020\u0066\u0061\u0069\u006c\u0065\u0064\u0020\u0050\u006c\u0065\u0061\u0073\u0065\u0020\u0063\u0068\u0065\u0063\u006b\u0020\u0069\u0066\u0020\u006e\u0065\u0077\u0020\u0067\u0072\u006f\u0075\u0070\u0020\u0065\u0078\u0069\u0073\u0074\u0073\u0020\u0043\u006f\u006e\u0073\u006f\u006c\u0065\u0020\u0069\u0073\u0020\u0072\u0065\u0070\u006f\u0072\u0074\u0069\u006e\u0067\u0020\u0061\u006e\u0020\u0065\u0072\u0072\u006f\u0072\u0021
\u5927\u6587\u4ef6\u4e0b\u8f7d\u7ed3\u675f\u0020\u0073\u0072\u0063\u003a\u0025\u0073\u0020\u0064\u0065\u0073\u0074\u003a\u0025\u0073\u0020\u6587\u4ef6\u5927\u5c0f\u003a\u0025\u0064\u0020\u4e0b\u8f7d\u5927\u5c0f\u003a\u0025\u0064=\u0045\u006e\u0064\u0020\u006f\u0066\u0020\u0064\u006f\u0077\u006e\u006c\u006f\u0061\u0064\u0020\u006f\u0066\u0020\u006c\u0061\u0072\u0067\u0065\u0020\u0066\u0069\u006c\u0065\u0020\u0073\u0072\u0063\u003a\u0025\u0073\u0020\u0064\u0065\u0073\u0074\u003a\u0025\u0073\u0020\u0046\u0069\u006c\u0065\u0020\u0073\u0069\u007a\u0065\u003a\u0025\u0064\u0020\u0044\u006f\u0077\u006e\u006c\u006f\u0061\u0064\u0020\u0073\u0069\u007a\u0065\u003a\u0025\u0064
\u76ee\u6807\u6587\u4ef6\u5927\u5c0f\u5927\u4e8e\u0033\u004d\u0042=\u0054\u0061\u0072\u0067\u0065\u0074\u0020\u0066\u0069\u006c\u0065\u0020\u0073\u0069\u007a\u0065\u0020\u0069\u0073\u0020\u006c\u0061\u0072\u0067\u0065\u0072\u0020\u0074\u0068\u0061\u006e\u0020\u0033\u004d\u0042
\u672a\u5b9a\u4e49\u8bf7\u6c42\u4fe1\u9053=\u0052\u0065\u0071\u0075\u0065\u0073\u0074\u0020\u0063\u0068\u0061\u006e\u006e\u0065\u006c\u0020\u006e\u006f\u0074\u0020\u0064\u0065\u0066\u0069\u006e\u0065\u0064
\u968f\u673a\u8bf7\u6c42\u53c2\u6570\u003a=\u0052\u0061\u006e\u0064\u006f\u006d\u0020\u0072\u0065\u0071\u0075\u0065\u0073\u0074\u0020\u0070\u0061\u0072\u0061\u006d\u0065\u0074\u0065\u0072\u0073\u003a
\u662f\u5426\u5f00\u542f\u5fc3\u8df3\u0020\u67d0\u4e9b\u7f51\u7ad9\u7684\u0073\u0065\u0073\u0073\u0069\u006f\u006e\u8fc7\u671f\u65f6\u95f4\u6bd4\u8f83\u77ed\u0020\u9700\u8981\u5f00\u542f\u52a8\u6001\u5fc3\u8df3=\u0057\u0068\u0065\u0074\u0068\u0065\u0072\u0020\u0074\u006f\u0020\u0065\u006e\u0061\u0062\u006c\u0065\u0020\u0068\u0065\u0061\u0072\u0074\u0062\u0065\u0061\u0074\u0020\u0053\u006f\u006d\u0065\u0020\u0073\u0069\u0074\u0065\u0073\u0020\u0068\u0061\u0076\u0065\u0020\u0061\u0020\u0073\u0068\u006f\u0072\u0074\u0020\u0073\u0065\u0073\u0073\u0069\u006f\u006e\u0020\u0065\u0078\u0070\u0069\u0072\u0061\u0074\u0069\u006f\u006e\u0020\u0074\u0069\u006d\u0065\u0020\u0061\u006e\u0064\u0020\u006e\u0065\u0065\u0064\u0020\u0074\u006f\u0020\u0065\u006e\u0061\u0062\u006c\u0065\u0020\u0064\u0079\u006e\u0061\u006d\u0069\u0063\u0020\u0068\u0065\u0061\u0072\u0074\u0062\u0065\u0061\u0074
\u76d1\u542c\u7aef\u53e3=\u004c\u0069\u0073\u0074\u0065\u006e\u0069\u006e\u0067\u0020\u0070\u006f\u0072\u0074
\u0061\u0064\u0064\u0072\u0065\u0073\u0073\u003a\u0025\u0073\u0020\u0070\u006f\u0072\u0074\u003a\u0025\u0073\u0020\u4e0d\u652f\u6301\u7684\u547d\u4ee4\u0020\u0063\u006f\u006d\u006d\u0061\u006e\u0064\u0020\u003a\u0020\u0025\u0064=\u0061\u0064\u0064\u0072\u0065\u0073\u0073\u003a\u0025\u0073\u0020\u0070\u006f\u0072\u0074\u003a\u0025\u0073\u0020\u0055\u006e\u0073\u0075\u0070\u0070\u006f\u0072\u0074\u0065\u0064\u0020\u0063\u006f\u006d\u006d\u0061\u006e\u0064\u0073\u0020\u0063\u006f\u006d\u006d\u0061\u006e\u0064\u0020\u003a\u0020\u0025\u0064
\u52a0\u5bc6\u5668\u5728\u751f\u6210\u65f6\u8fd4\u56de\u7a7a=\u0045\u006e\u0063\u0072\u0079\u0070\u0074\u006f\u0072\u0020\u0072\u0065\u0074\u0075\u0072\u006e\u0073\u0020\u006e\u0075\u006c\u006c\u0020\u0077\u0068\u0065\u006e\u0020\u0067\u0065\u006e\u0065\u0072\u0061\u0074\u0065\u0064
\u5df2\u505c\u6b62\u0021=\u0053\u0074\u006f\u0070\u0070\u0065\u0064\u0021
\u5728\u5f53\u524d\u7a97\u53e3\u7f16\u8f91\u6587\u4ef6=\u0045\u0064\u0069\u0074\u0020\u0066\u0069\u006c\u0065\u0020\u0069\u006e\u0020\u0063\u0075\u0072\u0072\u0065\u006e\u0074\u0020\u0077\u0069\u006e\u0064\u006f\u0077
\u76ee\u6807\u7aef\u53e3=\u0054\u0061\u0072\u0067\u0065\u0074\u0020\u0070\u006f\u0072\u0074
\u5907\u6ce8=\u0052\u0065\u006d\u0061\u0072\u006b\u0073
\u5927\u6587\u4ef6\u4e0a\u4f20\u5f00\u59cb\u0020\u6587\u4ef6\u540d\u003a\u0025\u0073=\u0053\u0074\u0061\u0072\u0074\u0020\u006f\u0066\u0020\u006c\u0061\u0072\u0067\u0065\u0020\u0066\u0069\u006c\u0065\u0020\u0075\u0070\u006c\u006f\u0061\u0064\u0020\u0046\u0069\u006c\u0065\u006e\u0061\u006d\u0065\u003a\u0025\u0073
\u662f\u5426\u5f00\u542f\u0068\u0074\u0074\u0070\u0073\u8bc1\u4e66\u5f3a\u8ba4\u8bc1=\u0057\u0068\u0065\u0074\u0068\u0065\u0072\u0020\u0074\u006f\u0020\u0065\u006e\u0061\u0062\u006c\u0065\u0020\u0073\u0074\u0072\u006f\u006e\u0067\u0020\u0061\u0075\u0074\u0068\u0065\u006e\u0074\u0069\u0063\u0061\u0074\u0069\u006f\u006e\u0020\u0077\u0069\u0074\u0068\u0020\u0068\u0074\u0074\u0070\u0073\u0020\u0063\u0065\u0072\u0074\u0069\u0066\u0069\u0063\u0061\u0074\u0065
\u5728\u7f16\u8f91\u5668\u7f16\u8f91\u6b64\u6587\u4ef6=\u0045\u0064\u0069\u0074\u0020\u0074\u0068\u0069\u0073\u0020\u0066\u0069\u006c\u0065\u0020\u0069\u006e\u0020\u0074\u0068\u0065\u0020\u0065\u0064\u0069\u0074\u006f\u0072
\u6570\u636e\u5e93\u7f16\u7801=\u0044\u0061\u0074\u0061\u0062\u0061\u0073\u0065\u0020\u0065\u006e\u0063\u006f\u0064\u0069\u006e\u0067
\u5b57\u4f53\u003a=\u0046\u006f\u006e\u0074\u003a
\u672a\u627e\u5230\u0048\u0074\u0074\u0070\u0050\u0072\u006f\u0078\u0079\u63d2\u4ef6\u0021=\u0048\u0074\u0074\u0070\u0050\u0072\u006f\u0078\u0079\u0020\u0070\u006c\u0075\u0067\u0069\u006e\u0020\u006e\u006f\u0074\u0020\u0066\u006f\u0075\u006e\u0064\u0021
\u751f\u6210=\u0047\u0065\u006e\u0065\u0072\u0061\u0074\u0065
\u0073\u006f\u0063\u006b\u0073\u0034\u0061\u002f\u0035\u0020\u7ed1\u5b9a\u5730\u5740\u003a=\u0073\u006f\u0063\u006b\u0073\u0034\u0061\u002f\u0035\u0020\u0062\u0069\u006e\u0064\u0069\u006e\u0067\u0020\u0061\u0064\u0064\u0072\u0065\u0073\u0073\u003a
\u5b57\u4f53\u5927\u5c0f\u003a=\u0046\u006f\u006e\u0074\u0020\u0073\u0069\u007a\u0065\u003a
\u65b0\u5efa\u6587\u4ef6\u6210\u529f=\u004e\u0065\u0077\u0020\u0066\u0069\u006c\u0065\u0020\u0063\u0072\u0065\u0061\u0074\u0065\u0064\u0020\u0073\u0075\u0063\u0063\u0065\u0073\u0073\u0066\u0075\u006c\u006c\u0079
\u968f\u673a\u8bf7\u6c42\u53c2\u6570\u540d\u5927\u5c0f\u003a=\u0052\u0061\u006e\u0064\u006f\u006d\u0020\u0072\u0065\u0071\u0075\u0065\u0073\u0074\u0020\u0070\u0061\u0072\u0061\u006d\u0065\u0074\u0065\u0072\u0020\u006e\u0061\u006d\u0065\u0020\u0073\u0069\u007a\u0065\u003a
\u65b0\u5efa\u6587\u4ef6\u5939=\u004e\u0065\u0077\u0020\u0046\u006f\u006c\u0064\u0065\u0072
\u5bc6\u7801=\u0050\u0061\u0073\u0073\u0077\u006f\u0072\u0064
\u538b\u7f29=\u0043\u006f\u006d\u0070\u0072\u0065\u0073\u0073\u0069\u006f\u006e
\u8b66\u544a\u005c\u0074\u5f53\u524d\u7248\u672c\u003a=\u0057\u0061\u0072\u006e\u0069\u006e\u0067\u0020\u005c\u0074\u0020\u0063\u0075\u0072\u0072\u0065\u006e\u0074\u0020\u0076\u0065\u0072\u0073\u0069\u006f\u006e\u003a
\u8f93\u5165\u6587\u4ef6\u5939\u540d\u79f0=\u0045\u006e\u0074\u0065\u0072\u0020\u0066\u006f\u006c\u0064\u0065\u0072\u0020\u006e\u0061\u006d\u0065
\u4f60\u4f7f\u7528\u7684\u8f6f\u4ef6\u53ef\u80fd\u5df2\u88ab\u75c5\u6bd2\u611f\u67d3\u0020\u0020\u0020\u6587\u4ef6\u54c8\u5e0c\u6548\u9a8c\u5931\u8d25\u005c\u0072\u005c\u006e\u6548\u9a8c\u004a\u0061\u0072\u54c8\u5e0c\u003a\u0025\u0073\u005c\u0072\u005c\u006e\u672c\u5730\u004a\u0061\u0072\u54c8\u5e0c\u003a\u0025\u0073=\u0054\u0068\u0065\u0020\u0073\u006f\u0066\u0074\u0077\u0061\u0072\u0065\u0020\u0079\u006f\u0075\u0020\u0061\u0072\u0065\u0020\u0075\u0073\u0069\u006e\u0067\u0020\u006d\u0061\u0079\u0020\u0068\u0061\u0076\u0065\u0020\u0062\u0065\u0065\u006e\u0020\u0069\u006e\u0066\u0065\u0063\u0074\u0065\u0064\u0020\u0077\u0069\u0074\u0068\u0020\u0061\u0020\u0076\u0069\u0072\u0075\u0073\u0020\u0046\u0069\u006c\u0065\u0020\u0068\u0061\u0073\u0068\u0020\u0076\u0061\u006c\u0069\u0064\u0061\u0074\u0069\u006f\u006e\u0020\u0066\u0061\u0069\u006c\u0065\u0064\u0020\u005c\u0072\u005c\u006e\u0020\u0076\u0061\u006c\u0069\u0064\u0061\u0074\u0065\u0020\u004a\u0061\u0072\u0020\u0068\u0061\u0073\u0068\u003a\u0025\u0073\u005c\u0072\u005c\u006e\u0020\u006c\u006f\u0063\u0061\u006c\u0020\u004a\u0061\u0072\u0020\u0068\u0061\u0073\u0068\u003a\u0025\u0073
\u9519\u8bef\u4fe1\u606f=\u0045\u0072\u0072\u006f\u0072\u0020\u006d\u0065\u0073\u0073\u0061\u0067\u0065
\u8fdb\u5165=\u0045\u006e\u0074\u0065\u0072
\u4e0a\u4f20\u8def\u5f84\u4e3a\u7a7a=\u0055\u0070\u006c\u006f\u0061\u0064\u0020\u0070\u0061\u0074\u0068\u0020\u0069\u0073\u0020\u0065\u006d\u0070\u0074\u0079
\u5f53\u524d\u8fdb\u7a0b\u662f\u0041\u0072\u0063\u0068\u003a\u0025\u0073\u0020\u0050\u0065\u662f\u0025\u0073=\u0043\u0075\u0072\u0072\u0065\u006e\u0074\u0020\u0070\u0072\u006f\u0063\u0065\u0073\u0073\u0020\u0069\u0073\u0020\u0041\u0072\u0063\u0068\u003a\u0025\u0073\u0020\u0050\u0065\u0020\u0069\u0073\u0020\u0025\u0073
\u79fb\u52a8\u002f\u91cd\u547d\u540d=\u004d\u006f\u0076\u0065\u002f\u0072\u0065\u006e\u0061\u006d\u0065
\u6dfb\u52a0\u0053\u0068\u0065\u006c\u006c=\u0041\u0064\u0064\u0020\u0053\u0068\u0065\u006c\u006c
\u76ee\u6807\u5730\u5740=\u0044\u0065\u0073\u0074\u0069\u006e\u0061\u0074\u0069\u006f\u006e\u0020\u0061\u0064\u0064\u0072\u0065\u0073\u0073
\u4ec5\u663e\u793a\u5f00\u653e\u7aef\u53e3=\u0053\u0068\u006f\u0077\u0020\u006f\u0070\u0065\u006e\u0020\u0070\u006f\u0072\u0074\u0073\u0020\u006f\u006e\u006c\u0079
\u8bf7\u6c42\u534f\u8bae\u5934=\u0052\u0065\u0071\u0075\u0065\u0073\u0074\u0020\u0070\u0072\u006f\u0074\u006f\u0063\u006f\u006c\u0020\u0068\u0065\u0061\u0064\u0065\u0072
\u4f60\u597d\u005c\u0074\u0048\u0065\u006c\u006c\u006f=\u0048\u0065\u006c\u006c\u006f\u0020\u005c\u0074\u0048\u0065\u006c\u006c\u006f
\u590d\u5236\u5230\u65b0\u7a97\u53e3=\u0043\u006f\u0070\u0079\u0020\u0074\u006f\u0020\u006e\u0065\u0077\u0020\u0077\u0069\u006e\u0064\u006f\u0077
\u4fdd\u5b58\u5931\u8d25\u0020\u6709\u6548\u8f7d\u8377\u5df2\u7ecf\u9500\u6bc1=\u0053\u0061\u0076\u0065\u0020\u0066\u0061\u0069\u006c\u0065\u0064\u0020\u0050\u0061\u0079\u006c\u006f\u0061\u0064\u0020\u0068\u0061\u0073\u0020\u0062\u0065\u0065\u006e\u0020\u0064\u0065\u0073\u0074\u0072\u006f\u0079\u0065\u0064
\u5f00\u542f\u0053\u006f\u0063\u006b\u0073\u0053\u0065\u0072\u0076\u0065\u0072=\u004f\u0070\u0065\u006e\u0020\u0053\u006f\u0063\u006b\u0073\u0053\u0065\u0072\u0076\u0065\u0072
\u662f\u5426\u5408\u5e76\u0073\u0068\u0065\u006c\u006c\u914d\u7f6e\u9875\u9762\u7684\u8bf7\u6c42\u5934=\u0057\u0068\u0065\u0074\u0068\u0065\u0072\u0020\u0074\u006f\u0020\u006d\u0065\u0072\u0067\u0065\u0020\u0072\u0065\u0071\u0075\u0065\u0073\u0074\u0020\u0068\u0065\u0061\u0064\u0065\u0072\u0073\u0020\u0066\u006f\u0072\u0020\u0073\u0068\u0065\u006c\u006c\u0020\u0063\u006f\u006e\u0066\u0069\u0067\u0075\u0072\u0061\u0074\u0069\u006f\u006e\u0020\u0070\u0061\u0067\u0065\u0073
\u0052\u0065\u0071\u0075\u0065\u0073\u0074\u0020\u67e5\u8be2\u5b57\u7b26\u4e32\u0020\u652f\u6301\u0043\u0032\u4fe1\u9053=\u0052\u0065\u0071\u0075\u0065\u0073\u0074\u0020\u0071\u0075\u0065\u0072\u0079\u0020\u0073\u0074\u0072\u0069\u006e\u0067\u0020\u0053\u0075\u0070\u0070\u006f\u0072\u0074\u0020\u0066\u006f\u0072\u0020\u0043\u0032\u0020\u0063\u0068\u0061\u006e\u006e\u0065\u006c\u0073
\u76ee\u6807\u4e0d\u662f\u6587\u4ef6=\u0054\u0061\u0072\u0067\u0065\u0074\u0020\u0069\u0073\u0020\u006e\u006f\u0074\u0020\u0061\u0020\u0066\u0069\u006c\u0065
\u5df2\u6709\u626b\u63cf\u7ebf\u7a0b=\u0053\u0063\u0061\u006e\u006e\u0069\u006e\u0067\u0020\u0074\u0068\u0072\u0065\u0061\u0064\u0073\u0020\u0061\u006c\u0072\u0065\u0061\u0064\u0079\u0020\u0061\u0076\u0061\u0069\u006c\u0061\u0062\u006c\u0065
\u542f\u52a8\u6210\u529f\u0021=\u0053\u0074\u0061\u0072\u0074\u0065\u0064\u0020\u0073\u0075\u0063\u0063\u0065\u0073\u0073\u0066\u0075\u006c\u006c\u0079\u0021
\u76ee\u6807\u6587\u4ef6\u5927\u5c0f\u5927\u4e8e\u0031\u004d\u0042=\u0054\u0061\u0072\u0067\u0065\u0074\u0020\u0066\u0069\u006c\u0065\u0020\u0073\u0069\u007a\u0065\u0020\u0067\u0072\u0065\u0061\u0074\u0065\u0072\u0020\u0074\u0068\u0061\u006e\u0020\u0031\u004d\u0042
\u5f00\u542f=\u004f\u0070\u0065\u006e
\u5927\u6587\u4ef6\u4e0b\u8f7d\u7ed3\u675f\u0020\u6587\u4ef6\u5927\u5c0f\u003a\u0025\u0064\u0020\u4e0b\u8f7d\u5927\u5c0f\u003a\u0025\u0064=\u0045\u006e\u0064\u0020\u006f\u0066\u0020\u006c\u0061\u0072\u0067\u0065\u0020\u0066\u0069\u006c\u0065\u0020\u0064\u006f\u0077\u006e\u006c\u006f\u0061\u0064\u0020\u0046\u0069\u006c\u0065\u0020\u0073\u0069\u007a\u0065\u003a\u0025\u0064\u0020\u0044\u006f\u0077\u006e\u006c\u006f\u0061\u0064\u0020\u0073\u0069\u007a\u0065\u003a\u0025\u0064
\u5927\u6587\u4ef6\u4e0a\u4f20=\u004c\u0061\u0072\u0067\u0065\u0020\u0066\u0069\u006c\u0065\u0020\u0075\u0070\u006c\u006f\u0061\u0064
\u8fd4\u56de\u4f53=\u0052\u0065\u0074\u0075\u0072\u006e\u0020\u0074\u006f\u0020\u0062\u006f\u0064\u0079
\u65b0\u5efa\u7ec4=\u004e\u0065\u0077\u0020\u0067\u0072\u006f\u0075\u0070
\u865a\u62df\u7ec8\u7aef=\u0056\u0069\u0072\u0074\u0075\u0061\u006c\u0020\u0054\u0065\u0072\u006d\u0069\u006e\u0061\u006c
\u0043\u006c\u0069\u0065\u006e\u0074\u5957\u63a5\u5b57\u5355\u6b21\u8bfb\u53d6\u5927\u5c0f\u003a=\u0043\u006c\u0069\u0065\u006e\u0074\u0020\u0073\u006f\u0063\u006b\u0065\u0074\u0020\u0073\u0069\u006e\u0067\u006c\u0065\u0020\u0072\u0065\u0061\u0064\u0020\u0073\u0069\u007a\u0065\u003a
\u5168\u5c40\u4ee3\u7406=\u0047\u006c\u006f\u0062\u0061\u006c\u0020\u0050\u0072\u006f\u0078\u0079
\u54cd\u5e94\u0043\u006f\u006f\u006b\u0069\u0065\u0020\u652f\u6301\u0043\u0032\u4fe1\u9053=\u0052\u0065\u0073\u0070\u006f\u006e\u0073\u0065\u0020\u0043\u006f\u006f\u006b\u0069\u0065\u0020\u0053\u0075\u0070\u0070\u006f\u0072\u0074\u0020\u0043\u0032\u0020\u0063\u0068\u0061\u006e\u006e\u0065\u006c
\u4e0b\u8f7d\u6210\u529f=\u0044\u006f\u0077\u006e\u006c\u006f\u0061\u0064\u0020\u0073\u0075\u0063\u0063\u0065\u0073\u0073
\u6587\u4ef6\u5c5e\u6027=\u0046\u0069\u006c\u0065\u0020\u0070\u0072\u006f\u0070\u0065\u0072\u0074\u0069\u0065\u0073
\u968f\u673a\u8bf7\u6c42\u53c2\u6570\u6570\u91cf\u003a=\u004e\u0075\u006d\u0062\u0065\u0072\u0020\u006f\u0066\u0020\u0072\u0061\u006e\u0064\u006f\u006d\u0020\u0072\u0065\u0071\u0075\u0065\u0073\u0074\u0020\u0070\u0061\u0072\u0061\u006d\u0065\u0074\u0065\u0072\u0073\u003a
\u901a\u9053\u4f4d\u7f6e\u003a\u0020\u0025\u0073\u0020\u004e\u0061\u006d\u0065\u003a\u0020\u0025\u0073=\u0043\u0068\u0061\u006e\u006e\u0065\u006c\u0020\u004c\u006f\u0063\u0061\u0074\u0069\u006f\u006e\u003a\u0020\u0025\u0073\u0020\u004e\u0061\u006d\u0065\u003a\u0020\u0025\u0073
\u4e0a\u4f20\u5355\u6b21\u8bfb\u53d6\u5b57\u8282\u003a=\u0055\u0070\u006c\u006f\u0061\u0064\u0065\u0064\u0020\u0073\u0069\u006e\u0067\u006c\u0065\u0020\u0072\u0065\u0061\u0064\u0020\u0062\u0079\u0074\u0065\u0073\u003a
\u4e0a\u5e1d\u6a21\u5f0f=\u0047\u006f\u0064\u0020\u004d\u006f\u0064\u0065
\u662f\u5426\u4f7f\u7528\u9ed8\u8ba4\u4ee3\u7406=\u0057\u0068\u0065\u0074\u0068\u0065\u0072\u0020\u0074\u006f\u0020\u0075\u0073\u0065\u0020\u0074\u0068\u0065\u0020\u0064\u0065\u0066\u0061\u0075\u006c\u0074\u0020\u0070\u0072\u006f\u0078\u0079
\u0070\u0061\u0073\u0073\u0077\u006f\u0072\u0064\u0020\u6216\u005c\u0074\u0020\u0073\u0065\u0063\u0072\u0065\u0074\u004b\u0065\u0079\u0020\u0020\u662f\u7a7a\u7684\u0021=\u0070\u0061\u0073\u0073\u0077\u006f\u0072\u0064\u0020\u006f\u0072\u0020\u005c\u0074\u0020\u0073\u0065\u0063\u0072\u0065\u0074\u004b\u0065\u0079\u0020\u0069\u0073\u0020\u0065\u006d\u0070\u0074\u0079\u0021
\u5220\u9664\u6210\u529f\u0021\u0020\u6210\u5458\u5df2\u79fb\u52a8\u5230\u0020\u002f=\u0044\u0065\u006c\u0065\u0074\u0065\u0064\u0020\u0073\u0075\u0063\u0063\u0065\u0073\u0073\u0066\u0075\u006c\u006c\u0079\u0021\u0020\u004d\u0065\u006d\u0062\u0065\u0072\u0020\u0068\u0061\u0073\u0020\u0062\u0065\u0065\u006e\u0020\u006d\u006f\u0076\u0065\u0064\u0020\u0074\u006f\u0020\u002f
\u79fb\u9664\u63d2\u4ef6\u5931\u8d25=\u0046\u0061\u0069\u006c\u0065\u0064\u0020\u0074\u006f\u0020\u0072\u0065\u006d\u006f\u0076\u0065\u0020\u0070\u006c\u0075\u0067\u0069\u006e
\u662f\u5426\u5f00\u542f\u0052\u0065\u0071\u0075\u0065\u0073\u0074\u0020\u0042\u006f\u0064\u0079\u5199\u5165=\u0057\u0068\u0065\u0074\u0068\u0065\u0072\u0020\u0074\u006f\u0020\u0065\u006e\u0061\u0062\u006c\u0065\u0020\u0052\u0065\u0071\u0075\u0065\u0073\u0074\u0020\u0042\u006f\u0064\u0079\u0020\u0077\u0072\u0069\u0074\u0069\u006e\u0067
\u4fe1\u9053\u5b9a\u4f4d\u65b9\u5f0f=\u0043\u0068\u0061\u006e\u006e\u0065\u006c\u0020\u006c\u006f\u0063\u0061\u0074\u0069\u006f\u006e\u0020\u006d\u0065\u0074\u0068\u006f\u0064
\u6b63\u5728\u68c0\u6d4b=\u0042\u0065\u0069\u006e\u0067\u0020\u0064\u0065\u0074\u0065\u0063\u0074\u0065\u0064
\u0048\u0074\u0074\u0070\u4ee3\u7406=\u0048\u0074\u0074\u0070\u0020\u0070\u0072\u006f\u0078\u0079
\u5f53\u524d\u8fde\u63a5\u6570\u003a\u0025\u0064\u0020\u5f53\u524d\u4e0a\u4f20\u901f\u5ea6\u003a\u0025\u0073\u002f\u0073\u0020\u5f53\u524d\u4e0b\u8f7d\u901f\u5ea6\u003a\u0025\u0073\u002f\u0073\u0020\u53d1\u9001\u6210\u529f\u8bf7\u6c42\u003a\u0025\u0073\u0020\u53d1\u9001\u5931\u8d25\u8bf7\u6c42\u003a\u0025\u0073\u0020\u76d1\u542c\u5730\u5740\u003a\u0025\u0073\u0020\u76d1\u542c\u7aef\u53e3\u003a\u0025\u0064\u0020\u5df2\u4e0a\u4f20\u003a\u0025\u0073\u0020\u5df2\u4e0b\u8f7d\u003a\u0025\u0073\u0020\u0020\u8fd0\u884c\u65f6\u95f4\u003a\u0025\u0064\u0073=\u0043\u0075\u0072\u0072\u0065\u006e\u0074\u0020\u0063\u006f\u006e\u006e\u0065\u0063\u0074\u0069\u006f\u006e\u0073\u003a\u0025\u0064\u0020\u0043\u0075\u0072\u0072\u0065\u006e\u0074\u0020\u0075\u0070\u006c\u006f\u0061\u0064\u0020\u0073\u0070\u0065\u0065\u0064\u003a\u0025\u0073\u002f\u0073\u0020\u0043\u0075\u0072\u0072\u0065\u006e\u0074\u0020\u0064\u006f\u0077\u006e\u006c\u006f\u0061\u0064\u0020\u0073\u0070\u0065\u0065\u0064\u003a\u0025\u0073\u002f\u0073\u0020\u0053\u0065\u006e\u0074\u0020\u0073\u0075\u0063\u0063\u0065\u0073\u0073\u0066\u0075\u006c\u0020\u0072\u0065\u0071\u0075\u0065\u0073\u0074\u0073\u003a\u0025\u0073\u0020\u0053\u0065\u006e\u0074\u0020\u0066\u0061\u0069\u006c\u0065\u0064\u0020\u0072\u0065\u0071\u0075\u0065\u0073\u0074\u0073\u003a\u0025\u0073\u0020\u004c\u0069\u0073\u0074\u0065\u006e\u0069\u006e\u0067\u0020\u0061\u0064\u0064\u0072\u0065\u0073\u0073\u003a\u0025\u0073\u0020\u004c\u0069\u0073\u0074\u0065\u006e\u0069\u006e\u0067\u0020\u0070\u006f\u0072\u0074\u003a\u0025\u0064\u0020\u0055\u0070\u006c\u006f\u0061\u0064\u0065\u0064\u003a\u0025\u0073\u0020\u0044\u006f\u0077\u006e\u006c\u006f\u0061\u0064\u0065\u0064\u003a\u0025\u0073\u0020\u0052\u0075\u006e\u006e\u0069\u006e\u0067\u0020\u0074\u0069\u006d\u0065\u003a\u0025\u0064\u0073
\u9519\u8bef\u91cd\u8bd5\u6700\u5927\u6b21\u6570\u003a=\u004d\u0061\u0078\u0069\u006d\u0075\u006d\u0020\u006e\u0075\u006d\u0062\u0065\u0072\u0020\u006f\u0066\u0020\u0065\u0072\u0072\u006f\u0072\u0020\u0072\u0065\u0074\u0072\u0069\u0065\u0073\u003a
\u4fee\u6539\u6210\u529f\u0021=\u004d\u006f\u0064\u0069\u0066\u0069\u0065\u0064\u0020\u0073\u0075\u0063\u0063\u0065\u0073\u0073\u0066\u0075\u006c\u006c\u0079\u0021
\u6267\u884c\u5931\u8d25=\u0046\u0061\u0069\u006c\u0065\u0064\u0020\u0074\u006f\u0020\u0065\u0078\u0065\u0063\u0075\u0074\u0065
\u0067\u0072\u006f\u0075\u0070\u662f\u7a7a\u7684=\u0067\u0072\u006f\u0075\u0070\u0020\u0069\u0073\u0020\u0065\u006d\u0070\u0074\u0079
\u8bfb\u53d6\u8d85\u65f6=\u0052\u0065\u0061\u0064\u0020\u0074\u0069\u006d\u0065\u006f\u0075\u0074
\u521b\u5efa\u5957\u63a5\u5b57\u7ed1\u5b9a\u5931\u8d25\u0020\u0064\u0065\u0073\u0074\u0048\u006f\u0073\u0074\u003a\u0025\u0073\u0020\u0064\u0065\u0073\u0074\u0050\u006f\u0072\u0074\u003a\u0025\u0073\u0020\u0065\u0072\u0072\u006d\u0073\u0067\u003a\u0025\u0073=\u0046\u0061\u0069\u006c\u0065\u0064\u0020\u0074\u006f\u0020\u0063\u0072\u0065\u0061\u0074\u0065\u0020\u0073\u006f\u0063\u006b\u0065\u0074\u0020\u0062\u0069\u006e\u0064\u0069\u006e\u0067\u0020\u0064\u0065\u0073\u0074\u0048\u006f\u0073\u0074\u003a\u0025\u0073\u0020\u0064\u0065\u0073\u0074\u0050\u006f\u0072\u0074\u003a\u0025\u0073\u0020\u0065\u0072\u0072\u006d\u0073\u0067\u003a\u0025\u0073
\u8bf7\u6c42\u914d\u7f6e=\u0052\u0065\u0071\u0075\u0065\u0073\u0074\u0020\u0063\u006f\u006e\u0066\u0069\u0067\u0075\u0072\u0061\u0074\u0069\u006f\u006e
\u65b0\u5efa\u6587\u4ef6\u5931\u8d25=\u0046\u0061\u0069\u006c\u0065\u0064\u0020\u0074\u006f\u0020\u0063\u0072\u0065\u0061\u0074\u0065\u0020\u0061\u0020\u006e\u0065\u0077\u0020\u0066\u0069\u006c\u0065
\u5747\u8861\u0055\u0072\u0069\u0020\u5982\u0020\u002f\u0075\u0070\u006c\u006f\u0061\u0064\u0020\u002f\u006c\u006f\u0067\u0069\u006e\u0020\u002f\u0064\u006f\u0077\u006e\u006c\u006f\u0061\u0064=\u0042\u0061\u006c\u0061\u006e\u0063\u0065\u0064\u0020\u0055\u0072\u0069\u0020\u0065\u002e\u0067\u002e\u0020\u002f\u0075\u0070\u006c\u006f\u0061\u0064\u0020\u002f\u006c\u006f\u0067\u0069\u006e\u0020\u002f\u0064\u006f\u0077\u006e\u006c\u006f\u0061\u0064
\u63d2\u4ef6=\u0050\u006c\u0075\u0067\u0069\u006e
\u4ee3\u7801\u6267\u884c=\u0043\u006f\u0064\u0065\u0020\u0065\u0078\u0065\u0063\u0075\u0074\u0069\u006f\u006e
\u0055\u0049\u914d\u7f6e=\u0055\u0049\u0020\u0063\u006f\u006e\u0066\u0069\u0067\u0075\u0072\u0061\u0074\u0069\u006f\u006e
\u5df2\u6709\u0077\u0069\u006e\u0070\u0074\u0079\u0020\u0063\u006f\u006e\u0073\u006f\u006c\u0065\u0020\u65e0\u9700\u518d\u6b21\u4e0a\u4f20=\u0057\u0069\u006e\u0070\u0074\u0079\u0020\u0063\u006f\u006e\u0073\u006f\u006c\u0065\u0020\u0061\u006c\u0072\u0065\u0061\u0064\u0079\u0020\u0065\u0078\u0069\u0073\u0074\u0073\u002c\u0020\u006e\u006f\u0020\u006e\u0065\u0065\u0064\u0020\u0074\u006f\u0020\u0075\u0070\u006c\u006f\u0061\u0064\u0020\u0061\u0067\u0061\u0069\u006e
\u0053\u0068\u0065\u006c\u006c\u7c7b\u578b=\u0053\u0068\u0065\u006c\u006c\u0020\u0074\u0079\u0070\u0065
\u652f\u6301\u7684\u0050\u0061\u0079\u006c\u006f\u0061\u0064=\u0053\u0075\u0070\u0070\u006f\u0072\u0074\u0065\u0064\u0020\u0050\u0061\u0079\u006c\u006f\u0061\u0064\u0073
\u4fe1\u606f\u586b\u5199\u4e0d\u5b8c\u6574=\u0049\u006e\u0063\u006f\u006d\u0070\u006c\u0065\u0074\u0065\u0020\u0069\u006e\u0066\u006f\u0072\u006d\u0061\u0074\u0069\u006f\u006e
\u8bf7\u6c42\u53f3\u8fb9\u8ffd\u52a0\u6570\u636e=\u0052\u0065\u0071\u0075\u0065\u0073\u0074\u0020\u0066\u006f\u0072\u0020\u0061\u0064\u0064\u0069\u0074\u0069\u006f\u006e\u0061\u006c\u0020\u0064\u0061\u0074\u0061\u0020\u006f\u006e\u0020\u0074\u0068\u0065\u0020\u0072\u0069\u0067\u0068\u0074
\u5206\u7ec4=\u0047\u0072\u006f\u0075\u0070\u0069\u006e\u0067
\u5bfc\u51fa=\u0045\u0078\u0070\u006f\u0072\u0074
\u5237\u65b0\u5931\u8d25\u0020\u6709\u6548\u8f7d\u8377\u5df2\u7ecf\u9500\u6bc1=\u0052\u0065\u0066\u0072\u0065\u0073\u0068\u0020\u0066\u0061\u0069\u006c\u0065\u0064\u0020\u0050\u0061\u0079\u006c\u006f\u0061\u0064\u0020\u0068\u0061\u0073\u0020\u0062\u0065\u0065\u006e\u0020\u0064\u0065\u0073\u0074\u0072\u006f\u0079\u0065\u0064
\u5f53\u524d\u8fde\u63a5\u6570\u003a\u0031\u0030\u0020\u5f53\u524d\u901f\u5ea6\u003a\u0031\u0030\u0030\u006b\u002f\u0073\u0020\u5df2\u53d1\u5305\u003a\u0031\u0030\u0030\u0030\u0020\u5df2\u4e0a\u4f20\u003a\u0031\u0030\u006d\u0062\u0020\u5df2\u4e0b\u8f7d\u003a\u0032\u0030\u006d\u0062\u0020\u0020\u8fd0\u884c\u65f6\u95f4\u003a\u0031\u0068=\u0043\u0075\u0072\u0072\u0065\u006e\u0074\u0020\u0063\u006f\u006e\u006e\u0065\u0063\u0074\u0069\u006f\u006e\u0073\u003a\u0031\u0030\u0020\u0043\u0075\u0072\u0072\u0065\u006e\u0074\u0020\u0073\u0070\u0065\u0065\u0064\u003a\u0031\u0030\u0030\u006b\u002f\u0073\u0020\u0050\u0061\u0063\u006b\u0065\u0074\u0073\u0020\u0073\u0065\u006e\u0074\u003a\u0031\u0030\u0030\u0030\u0020\u0050\u0061\u0063\u006b\u0065\u0074\u0073\u0020\u0075\u0070\u006c\u006f\u0061\u0064\u0065\u0064\u003a\u0031\u0030\u006d\u0062\u0020\u0050\u0061\u0063\u006b\u0065\u0074\u0073\u0020\u0064\u006f\u0077\u006e\u006c\u006f\u0061\u0064\u0065\u0064\u003a\u0032\u0030\u006d\u0062\u0020\u0052\u0075\u006e\u006e\u0069\u006e\u0067\u0020\u0074\u0069\u006d\u0065\u003a\u0031\u0068
\u5df2\u5f00\u542f\u626b\u63cf=\u0053\u0063\u0061\u006e\u006e\u0069\u006e\u0067\u0020\u0068\u0061\u0073\u0020\u0062\u0065\u0065\u006e\u0020\u0065\u006e\u0061\u0062\u006c\u0065\u0064
\u76ee\u6807\u662f\u6587\u4ef6\u5939=\u0054\u0061\u0072\u0067\u0065\u0074\u0020\u0069\u0073\u0020\u0066\u006f\u006c\u0064\u0065\u0072
\u6570\u636e\u5e93\u4e3b\u673a=\u0044\u0061\u0074\u0061\u0062\u0061\u0073\u0065\u0020\u0068\u006f\u0073\u0074
\u63d2\u4ef6\u6807\u7b7e\u7ba1\u7406=\u0050\u006c\u0075\u0067\u0069\u006e\u0020\u0074\u0061\u0067\u0020\u006d\u0061\u006e\u0061\u0067\u0065\u006d\u0065\u006e\u0074
\u5904\u7406\u0073\u006f\u0063\u006b\u0073\u534f\u8bae\u7528\u65f6\u0020\u0025\u0064\u006d\u0073=\u0054\u0069\u006d\u0065\u0020\u0073\u0070\u0065\u006e\u0074\u0020\u0070\u0072\u006f\u0063\u0065\u0073\u0073\u0069\u006e\u0067\u0020\u0073\u006f\u0063\u006b\u0073\u0020\u0070\u0072\u006f\u0074\u006f\u0063\u006f\u006c\u0020\u0025\u0064\u006d\u0073
\u8fde\u63a5\u0073\u006f\u0063\u006b\u0065\u0074\u5931\u8d25\u0020\u0073\u006f\u0063\u006b\u0065\u0074\u0049\u0064\u003a\u0025\u0073\u0020\u0064\u006f\u006d\u0061\u0069\u006e\u003a\u0025\u0073\u0020\u0070\u006f\u0072\u0074\u003a\u0025\u0073=\u0046\u0061\u0069\u006c\u0065\u0064\u0020\u0074\u006f\u0020\u0063\u006f\u006e\u006e\u0065\u0063\u0074\u0020\u0074\u006f\u0020\u0073\u006f\u0063\u006b\u0065\u0074\u0020\u0073\u006f\u0063\u006b\u0065\u0074\u0049\u0064\u003a\u0025\u0073\u0020\u0064\u006f\u006d\u0061\u0069\u006e\u003a\u0025\u0073\u0020\u0070\u006f\u0072\u0074\u003a\u0025\u0073
\u76d1\u542c\u5730\u5740=\u004c\u0069\u0073\u0074\u0065\u006e\u0069\u006e\u0067\u0020\u0061\u0064\u0064\u0072\u0065\u0073\u0073
\u6ca1\u6709\u542f\u52a8\u0021=\u004e\u006f\u0074\u0020\u0073\u0074\u0061\u0072\u0074\u0065\u0064\u0021
\u4e0d\u652f\u6301\u591a\u6587\u4ef6\u64cd\u4f5c=\u004d\u0075\u006c\u0074\u0069\u002d\u0066\u0069\u006c\u0065\u0020\u006f\u0070\u0065\u0072\u0061\u0074\u0069\u006f\u006e\u0073\u0020\u0061\u0072\u0065\u0020\u006e\u006f\u0074\u0020\u0073\u0075\u0070\u0070\u006f\u0072\u0074\u0065\u0064
\u5173\u95ed\u0073\u0068\u0065\u006c\u006c\u540e\u662f\u5426\u6e05\u9664\u0073\u0068\u0065\u006c\u006c\u5728\u670d\u52a1\u5668\u7684\u7f13\u5b58=\u0057\u0068\u0065\u0074\u0068\u0065\u0072\u0020\u0074\u006f\u0020\u0063\u006c\u0065\u0061\u0072\u0020\u0074\u0068\u0065\u0020\u0073\u0068\u0065\u006c\u006c\u0027\u0073\u0020\u0063\u0061\u0063\u0068\u0065\u0020\u006f\u006e\u0020\u0074\u0068\u0065\u0020\u0073\u0065\u0072\u0076\u0065\u0072\u0020\u0061\u0066\u0074\u0065\u0072\u0020\u0063\u006c\u006f\u0073\u0069\u006e\u0067\u0020\u0069\u0074
\u5b57\u4f53\u8bbe\u7f6e=\u0046\u006f\u006e\u0074\u0020\u0073\u0065\u0074\u0074\u0069\u006e\u0067\u0073
\u6570\u636e\u5e93\u7ba1\u7406=\u0044\u0061\u0074\u0061\u0062\u0061\u0073\u0065\u0020\u006d\u0061\u006e\u0061\u0067\u0065\u006d\u0065\u006e\u0074
\u6dfb\u52a0\u6210\u529f\u0021=\u0041\u0064\u0064\u0065\u0064\u0020\u0073\u0075\u0063\u0063\u0065\u0073\u0073\u0066\u0075\u006c\u006c\u0079\u0021
\u7528\u6237\u53d6\u6d88\u9009\u62e9=\u0055\u0073\u0065\u0072\u0020\u0064\u0065\u0073\u0065\u006c\u0065\u0063\u0074\u0065\u0064
\u5bc6\u94a5=\u004b\u0065\u0079
\u662f\u5426\u5f00\u542f\u5747\u8861\u0050\u0072\u006f\u0078\u0079\u0020\u4f1a\u968f\u673a\u4f7f\u7528\u5176\u4e2d\u4efb\u610f\u4e00\u4e2a\u0070\u0072\u006f\u0078\u0079=\u0057\u0068\u0065\u0074\u0068\u0065\u0072\u0020\u0074\u006f\u0020\u0074\u0075\u0072\u006e\u0020\u006f\u006e\u0020\u0042\u0061\u006c\u0061\u006e\u0063\u0065\u0064\u0020\u0050\u0072\u006f\u0078\u0079\u0020\u0077\u0069\u006c\u006c\u0020\u0072\u0061\u006e\u0064\u006f\u006d\u006c\u0079\u0020\u0075\u0073\u0065\u0020\u0061\u006e\u0079\u0020\u006f\u006e\u0065\u0020\u006f\u0066\u0020\u0074\u0068\u0065\u0020\u0070\u0072\u006f\u0078\u0069\u0065\u0073
\u672a\u9009\u4e2d\u4e0b\u8f7d\u6587\u4ef6=\u0044\u006f\u0077\u006e\u006c\u006f\u0061\u0064\u0020\u0066\u0069\u006c\u0065\u0020\u006e\u006f\u0074\u0020\u0073\u0065\u006c\u0065\u0063\u0074\u0065\u0064
\u8fd4\u56de=\u0052\u0065\u0074\u0075\u0072\u006e
\u5df2\u6709\u0077\u0069\u006e\u0070\u0074\u0079\u0020\u0064\u006c\u006c\u0020\u65e0\u9700\u518d\u6b21\u4e0a\u4f20=\u0041\u006c\u0072\u0065\u0061\u0064\u0079\u0020\u0068\u0061\u0076\u0065\u0020\u0077\u0069\u006e\u0070\u0074\u0079\u0020\u0064\u006c\u006c\u0020\u006e\u006f\u0020\u006e\u0065\u0065\u0064\u0020\u0074\u006f\u0020\u0075\u0070\u006c\u006f\u0061\u0064\u0020\u0061\u0067\u0061\u0069\u006e
\u53d6\u6d88\u9009\u62e9\u002e\u002e\u002e\u002e\u002e\u002e=\u0044\u0065\u0073\u0065\u006c\u0065\u0063\u0074\u0020\u002e\u002e\u002e\u002e\u002e\u002e
\u63d2\u4ef6\u52a0\u8f7d\u5931\u8d25=\u0050\u006c\u0075\u0067\u0069\u006e\u0020\u0066\u0061\u0069\u006c\u0065\u0064\u0020\u0074\u006f\u0020\u006c\u006f\u0061\u0064
\u5168\u5c40\u534f\u8bae\u5934=\u0047\u006c\u006f\u0062\u0061\u006c\u0020\u0070\u0072\u006f\u0074\u006f\u0063\u006f\u006c\u0020\u0068\u0065\u0061\u0064\u0065\u0072
\u786e\u5b9a\u5220\u9664\u7ec4\uff1a\u0025\u0073\u0020\u5417\u003f=\u0053\u0075\u0072\u0065\u0020\u0074\u006f\u0020\u0064\u0065\u006c\u0065\u0074\u0065\u0020\u0067\u0072\u006f\u0075\u0070\u003a\u0020\u0025\u0073\u003f
\u8bf7\u68c0\u67e5\u0020\u0020\u0075\u0072\u006c\u0020\u0070\u0061\u0073\u0073\u0077\u006f\u0072\u0064\u0020\u0073\u0065\u0063\u0072\u0065\u0074\u004b\u0065\u0079\u0020\u0070\u0061\u0079\u006c\u006f\u0061\u0064\u0020\u0063\u0072\u0079\u0070\u0074\u0069\u006f\u006e\u0020\u0065\u006e\u0063\u006f\u0064\u0069\u006e\u0067\u0020\u662f\u5426\u586b\u5199\u5b8c\u6574=\u0050\u006c\u0065\u0061\u0073\u0065\u0020\u0063\u0068\u0065\u0063\u006b\u0020\u0074\u0068\u0061\u0074\u0020\u0074\u0068\u0065\u0020\u0075\u0072\u006c\u0020\u0070\u0061\u0073\u0073\u0077\u006f\u0072\u0064\u0020\u0073\u0065\u0063\u0072\u0065\u0074\u004b\u0065\u0079\u0020\u0070\u0061\u0079\u006c\u006f\u0061\u0064\u0020\u0063\u0072\u0079\u0070\u0074\u0069\u006f\u006e\u0020\u0065\u006e\u0063\u006f\u0064\u0069\u006e\u0067\u0020\u0069\u0073\u0020\u0063\u006f\u006d\u0070\u006c\u0065\u0074\u0065
\u6b63\u5728\u8fde\u63a5\u002e\u002e\u002e\u8bf7\u7a0d\u7b49=\u0043\u006f\u006e\u006e\u0065\u0063\u0074\u0069\u006e\u0067\u002e\u002e\u002e\u0020\u0050\u006c\u0065\u0061\u0073\u0065\u0020\u0077\u0061\u0069\u0074
\u662f\u5426\u5f00\u542f\u5747\u8861\u0055\u0072\u0069\u0020\u4f1a\u968f\u673a\u4f7f\u7528\u5176\u4e2d\u4efb\u610f\u4e00\u4e2a\u0075\u0072\u0069=\u0049\u0073\u0020\u0062\u0061\u006c\u0061\u006e\u0063\u0065\u0064\u0020\u0055\u0072\u0069\u0020\u0065\u006e\u0061\u0062\u006c\u0065\u0064\u003f\u0020\u0041\u006e\u0079\u0020\u006f\u006e\u0065\u0020\u006f\u0066\u0020\u0074\u0068\u0065\u0020\u0075\u0072\u0069\u0073\u0020\u0077\u0069\u006c\u006c\u0020\u0062\u0065\u0020\u0075\u0073\u0065\u0064\u0020\u0072\u0061\u006e\u0064\u006f\u006d\u006c\u0079
\u5de6\u8fb9\u8ffd\u52a0\u6570\u636e=\u0041\u0070\u0070\u0065\u006e\u0064\u0020\u0064\u0061\u0074\u0061\u0020\u006f\u006e\u0020\u0074\u0068\u0065\u0020\u006c\u0065\u0066\u0074
\u8f93\u5165\u53ef\u6267\u884c\u6587\u4ef6\u540d\u79f0=\u0045\u006e\u0074\u0065\u0072\u0020\u0074\u0068\u0065\u0020\u006e\u0061\u006d\u0065\u0020\u006f\u0066\u0020\u0074\u0068\u0065\u0020\u0065\u0078\u0065\u0063\u0075\u0074\u0061\u0062\u006c\u0065\u0020\u0066\u0069\u006c\u0065
\u8bf7\u6c42\u8868\u5355\u53c2\u6570\u0020\u652f\u6301\u0043\u0032\u4fe1\u9053=\u0052\u0065\u0071\u0075\u0065\u0073\u0074\u0020\u0066\u006f\u0072\u006d\u0020\u0070\u0061\u0072\u0061\u006d\u0065\u0074\u0065\u0072\u0073\u0020\u0043\u0032\u0020\u0063\u0068\u0061\u006e\u006e\u0065\u006c\u0020\u0073\u0075\u0070\u0070\u006f\u0072\u0074
\u81ea\u52a8\u5173\u95ed\u0053\u0068\u0065\u006c\u006c=\u0041\u0075\u0074\u006f\u006d\u0061\u0074\u0069\u0063\u0061\u006c\u006c\u0079\u0020\u0063\u006c\u006f\u0073\u0065\u0073\u0020\u0074\u0068\u0065\u0020\u0073\u0068\u0065\u006c\u006c
\u4fdd\u5b58\u914d\u7f6e=\u0053\u0061\u0076\u0065\u0020\u0063\u006f\u006e\u0066\u0069\u0067\u0075\u0072\u0061\u0074\u0069\u006f\u006e
\u0048\u0074\u0074\u0070\u0054\u006f\u0053\u006f\u0063\u006b\u0073\u672a\u542f\u52a8=\u0048\u0074\u0074\u0070\u0054\u006f\u0053\u006f\u0063\u006b\u0073\u0020\u0069\u0073\u0020\u006e\u006f\u0074\u0020\u0073\u0074\u0061\u0072\u0074\u0065\u0064
\u5b57\u4f53\u003a=\u0046\u006f\u006e\u0074\u003a
\u7aef\u53e3\u626b\u63cf=\u0050\u006f\u0072\u0074\u0020\u0053\u0063\u0061\u006e
\u8bf7\u6c42\u0075\u0072\u006c\u53c2\u6570\u0020\u652f\u6301\u0043\u0032\u4fe1\u9053=\u0052\u0065\u0071\u0075\u0065\u0073\u0074\u0020\u0075\u0072\u006c\u0020\u0070\u0061\u0072\u0061\u006d\u0065\u0074\u0065\u0072\u0073\u0020\u0053\u0075\u0070\u0070\u006f\u0072\u0074\u0020\u0043\u0032\u0020\u0063\u0068\u0061\u006e\u006e\u0065\u006c\u0073
\u8b66\u544a=\u0057\u0061\u0072\u006e\u0069\u006e\u0067
\u5df2\u627e\u5230\u0050\u0079\u0074\u0068\u006f\u006e\u89e3\u91ca\u5668\u0020\u89e3\u91ca\u5668\u540d\u002d\u003e\u0025\u0073\u0020\u6d3e\u751f\u547d\u4ee4\u002d\u003e\u0025\u0073=\u0050\u0079\u0074\u0068\u006f\u006e\u0020\u0069\u006e\u0074\u0065\u0072\u0070\u0072\u0065\u0074\u0065\u0072\u0020\u0066\u006f\u0075\u006e\u0064\u0020\u0049\u006e\u0074\u0065\u0072\u0070\u0072\u0065\u0074\u0065\u0072\u0020\u006e\u0061\u006d\u0065\u002d\u003e\u0025\u0073\u0020\u0044\u0065\u0072\u0069\u0076\u0065\u0064\u0020\u0063\u006f\u006d\u006d\u0061\u006e\u0064\u002d\u003e\u0025\u0073
\u79fb\u52a8\u6210\u529f\u0021=\u004d\u006f\u0076\u0065\u0020\u0073\u0075\u0063\u0063\u0065\u0073\u0073\u0066\u0075\u006c\u0021
\u76ee\u6807\u4e0d\u662f\u6587\u4ef6\u0020\u6216\u4e0d\u53ef\u8bfb=\u0054\u0061\u0072\u0067\u0065\u0074\u0020\u0069\u0073\u0020\u006e\u006f\u0074\u0020\u0061\u0020\u0066\u0069\u006c\u0065\u0020\u006f\u0072\u0020\u006e\u006f\u0074\u0020\u0072\u0065\u0061\u0064\u0061\u0062\u006c\u0065
\u0061\u0064\u0064\u0072\u0065\u0073\u0073\u003a\u0025\u0073\u0020\u0070\u006f\u0072\u0074\u003a\u0025\u0073\u0020\u4e0d\u652f\u6301\u7684\u8ba4\u8bc1\u65b9\u6cd5\u003a\u0025\u0073=\u0061\u0064\u0064\u0072\u0065\u0073\u0073\u003a\u0025\u0073\u0020\u0070\u006f\u0072\u0074\u003a\u0025\u0073\u0020\u0075\u006e\u0073\u0075\u0070\u0070\u006f\u0072\u0074\u0065\u0064\u0020\u0061\u0075\u0074\u0068\u0065\u006e\u0074\u0069\u0063\u0061\u0074\u0069\u006f\u006e\u0020\u006d\u0065\u0074\u0068\u006f\u0064\u003a\u0025\u0073
\u004c\u0069\u0076\u0065\u0053\u0063\u0061\u006e\u0043\u006f\u006d\u0070\u006c\u0065\u0074\u0065\u003a\u0020\u7528\u65f6\u003a\u0025\u0073\u006d\u0073=\u004c\u0069\u0076\u0065\u0053\u0063\u0061\u006e\u0043\u006f\u006d\u0070\u006c\u0065\u0074\u0065\u003a\u0020\u0074\u0069\u006d\u0065\u003a\u0025\u0073\u006d\u0073
\u662f\u5426\u5408\u5e76\u8fd4\u56de\u5305\u7684\u0020\u005c=\u0057\u0068\u0065\u0074\u0068\u0065\u0072\u0020\u0074\u006f\u0020\u006d\u0065\u0072\u0067\u0065\u0020\u0074\u0068\u0065\u0020\u0072\u0065\u0074\u0075\u0072\u006e\u0020\u0070\u0061\u0063\u006b\u0065\u0074\u0073\u0020\u005c
\u91cd\u7f6e\u6210\u529f\u0021\u0020\u91cd\u542f\u7a0b\u5e8f\u751f\u6548\u0021=\u0052\u0065\u0073\u0065\u0074\u0020\u0073\u0075\u0063\u0063\u0065\u0073\u0073\u0066\u0075\u006c\u0021\u0020\u0052\u0065\u0073\u0074\u0061\u0072\u0074\u0069\u006e\u0067\u0020\u0074\u0068\u0065\u0020\u0070\u0072\u006f\u0067\u0072\u0061\u006d\u0020\u0074\u0061\u006b\u0065\u0073\u0020\u0065\u0066\u0066\u0065\u0063\u0074\u0021
\u5b58\u6d3b\u626b\u63cf=\u004c\u0069\u0076\u0065\u0020\u0073\u0063\u0061\u006e
\u786e\u5b9a\u5220\u9664\u0069\u0064\u5728\u0020\u0025\u0073\u0020\u7684\u0073\u0068\u0065\u006c\u006c\u5417\u003f=\u0053\u0075\u0072\u0065\u0020\u0074\u006f\u0020\u0064\u0065\u006c\u0065\u0074\u0065\u0020\u0074\u0068\u0065\u0020\u0073\u0068\u0065\u006c\u006c\u0020\u0077\u0069\u0074\u0068\u0020\u0069\u0064\u0020\u0069\u006e\u0020\u0025\u0073\u003f
\u8bf7\u68c0\u67e5\u662f\u5426\u586b\u5199\u5b8c\u6574=\u0050\u006c\u0065\u0061\u0073\u0065\u0020\u0063\u0068\u0065\u0063\u006b\u0020\u0069\u0066\u0020\u0069\u0074\u0020\u0069\u0073\u0020\u0066\u0069\u006c\u006c\u0065\u0064\u0020\u0069\u006e\u0020\u0063\u006f\u006d\u0070\u006c\u0065\u0074\u0065\u006c\u0079
\u4e0a\u4f20\u0057\u0069\u006e\u0070\u0074\u0079\u0020\u0061\u0067\u0065\u006e\u0074\u5931\u8d25=\u0046\u0061\u0069\u006c\u0065\u0064\u0020\u0074\u006f\u0020\u0075\u0070\u006c\u006f\u0061\u0064\u0020\u0057\u0069\u006e\u0070\u0074\u0079\u0020\u0061\u0067\u0065\u006e\u0074
\u9519\u8bef=\u0045\u0072\u0072\u006f\u0072
\u91cd\u7f6e\u8bc1\u4e66=\u0052\u0065\u0073\u0065\u0074\u0020\u0063\u0065\u0072\u0074\u0069\u0066\u0069\u0063\u0061\u0074\u0065
\u968f\u673a\u8bf7\u6c42\u53c2\u6570\u503c\u5927\u5c0f\u003a=\u0052\u0061\u006e\u0064\u006f\u006d\u0020\u0072\u0065\u0071\u0075\u0065\u0073\u0074\u0020\u0070\u0061\u0072\u0061\u006d\u0065\u0074\u0065\u0072\u0020\u0076\u0061\u006c\u0075\u0065\u0020\u0073\u0069\u007a\u0065\u003a
\u672a\u627e\u5230\u5f53\u524d\u7248\u672c\u0028\u0025\u0073\u0029\u7684\u0048\u0061\u0073\u0068\u005c\u0072\u005c\u006e\u5f53\u524d\u0048\u0061\u0073\u0068\u003a\u0025\u0073\u005c\u0072\u005c\u006e\u4f60\u4f7f\u7528\u7684\u8f6f\u4ef6\u53ef\u80fd\u5df2\u88ab\u75c5\u6bd2\u611f\u67d3\u0020\u0020\u0020\u6587\u4ef6\u54c8\u5e0c\u6548\u9a8c\u5931\u8d25=\u0048\u0061\u0073\u0068\u0020\u006e\u006f\u0074\u0020\u0066\u006f\u0075\u006e\u0064\u0020\u0066\u006f\u0072\u0020\u0063\u0075\u0072\u0072\u0065\u006e\u0074\u0020\u0076\u0065\u0072\u0073\u0069\u006f\u006e\u0020\u0028\u0025\u0073\u0029\u005c\u0072\u005c\u006e\u0043\u0075\u0072\u0072\u0065\u006e\u0074\u0020\u0048\u0061\u0073\u0068\u003a\u0025\u0073\u005c\u0072\u005c\u006e\u0054\u0068\u0065\u0020\u0073\u006f\u0066\u0074\u0077\u0061\u0072\u0065\u0020\u0079\u006f\u0075\u0020\u0061\u0072\u0065\u0020\u0075\u0073\u0069\u006e\u0067\u0020\u006d\u0061\u0079\u0020\u0068\u0061\u0076\u0065\u0020\u0062\u0065\u0065\u006e\u0020\u0069\u006e\u0066\u0065\u0063\u0074\u0065\u0064\u0020\u0062\u0079\u0020\u0061\u0020\u0076\u0069\u0072\u0075\u0073\u0020\u0046\u0069\u006c\u0065\u0020\u0068\u0061\u0073\u0068\u0020\u0076\u0061\u006c\u0069\u0064\u0061\u0074\u0069\u006f\u006e\u0020\u0066\u0061\u0069\u006c\u0065\u0064
\u4e0b\u8f7d\u5931\u8d25=\u0044\u006f\u0077\u006e\u006c\u006f\u0061\u0064\u0020\u0066\u0061\u0069\u006c\u0065\u0064
\u9519\u8bef\u6b21\u6570\u8d85\u9650=\u0045\u0072\u0072\u006f\u0072\u0020\u0063\u006f\u0075\u006e\u0074\u0020\u0065\u0078\u0063\u0065\u0065\u0064\u0065\u0064
\u521b\u5efa\u5957\u63a5\u5b57\u5931\u8d25\u0020\u0064\u0065\u0073\u0074\u0048\u006f\u0073\u0074\u003a\u0025\u0073\u0020\u0064\u0065\u0073\u0074\u0050\u006f\u0072\u0074\u003a\u0025\u0073\u0020\u0065\u0072\u0072\u006d\u0073\u0067\u003a\u0025\u0073=\u0046\u0061\u0069\u006c\u0065\u0064\u0020\u0074\u006f\u0020\u0063\u0072\u0065\u0061\u0074\u0065\u0020\u0061\u0020\u0073\u006f\u0063\u006b\u0065\u0074\u0020\u0064\u0065\u0073\u0074\u0048\u006f\u0073\u0074\u003a\u0025\u0073\u0020\u0064\u0065\u0073\u0074\u0050\u006f\u0072\u0074\u003a\u0025\u0073\u0020\u0065\u0072\u0072\u006d\u0073\u0067\u003a\u0025\u0073
\u9519\u8bef\u63d0\u793a=\u0045\u0072\u0072\u006f\u0072\u0020\u006d\u0065\u0073\u0073\u0061\u0067\u0065
\u6570\u636e\u5e93\u5bc6\u7801=\u0044\u0061\u0074\u0061\u0062\u0061\u0073\u0065\u0020\u0070\u0061\u0073\u0073\u0077\u006f\u0072\u0064
\u4e0d\u652f\u6301\u7684\u64cd\u4f5c=\u0055\u006e\u0073\u0075\u0070\u0070\u006f\u0072\u0074\u0065\u0064\u0020\u006f\u0070\u0065\u0072\u0061\u0074\u0069\u006f\u006e\u0073
\u590d\u5236\u5f53\u524d\u7ec4\u8def\u5f84=\u0043\u006f\u0070\u0079\u0020\u0063\u0075\u0072\u0072\u0065\u006e\u0074\u0020\u0067\u0072\u006f\u0075\u0070\u0020\u0070\u0061\u0074\u0068
\u521b\u5efa\u5957\u63a5\u5b57\u7ed1\u5b9a\u6210\u529f=\u0043\u0072\u0065\u0061\u0074\u0065\u0020\u0073\u006f\u0063\u006b\u0065\u0074\u0020\u0062\u0069\u006e\u0064\u0069\u006e\u0067\u0020\u0073\u0075\u0063\u0063\u0065\u0073\u0073
\u0061\u0064\u0064\u0072\u0065\u0073\u0073\u003a\u0025\u0073\u0020\u0070\u006f\u0072\u0074\u003a\u0025\u0073\u0020\u4e0d\u662f\u0073\u006f\u0063\u006b\u0073\u0035=\u0061\u0064\u0064\u0072\u0065\u0073\u0073\u003a\u0025\u0073\u0020\u0070\u006f\u0072\u0074\u003a\u0025\u0073\u0020\u006e\u006f\u0074\u0020\u0073\u006f\u0063\u006b\u0073\u0035
\u8bf7\u6c42\u67e5\u8be2\u5b57\u7b26\u4e32=\u0052\u0065\u0071\u0075\u0065\u0073\u0074\u0020\u0071\u0075\u0065\u0072\u0079\u0020\u0073\u0074\u0072\u0069\u006e\u0067
\u547d\u4ee4\u6267\u884c\u6a21\u5f0f\u003a=\u0043\u006f\u006d\u006d\u0061\u006e\u0064\u0020\u0065\u0078\u0065\u0063\u0075\u0074\u0069\u006f\u006e\u0020\u006d\u006f\u0064\u0065\u003a
\u5220\u9664\u6587\u4ef6=\u0044\u0065\u006c\u0065\u0074\u0065\u0020\u0066\u0069\u006c\u0065
\u7c7b\u003a\u0020\u0025\u0073\u0020\u6620\u5c04\u4e0d\u5b58\u5728=\u0063\u006c\u0061\u0073\u0073\u003a\u0020\u0025\u0073\u0020\u006d\u0061\u0070\u0070\u0069\u006e\u0067\u0020\u0064\u006f\u0065\u0073\u0020\u006e\u006f\u0074\u0020\u0065\u0078\u0069\u0073\u0074
\u4ee3\u7406\u7aef\u53e3=\u0050\u0072\u006f\u0078\u0079\u0020\u0070\u006f\u0072\u0074
\u5957\u63a5\u5b57\u7f13\u51b2\u961f\u5217\u6570=\u004e\u0075\u006d\u0062\u0065\u0072\u0020\u006f\u0066\u0020\u0073\u006f\u0063\u006b\u0065\u0074\u0020\u0062\u0075\u0066\u0066\u0065\u0072\u0020\u0071\u0075\u0065\u0075\u0065\u0073
\u542f\u52a8\u5931\u8d25\u0021\u0020\u9519\u8bef\u4fe1\u606f\u003a\u0025\u0073=\u0046\u0061\u0069\u006c\u0065\u0064\u0020\u0074\u006f\u0020\u0073\u0074\u0061\u0072\u0074\u0021\u0020\u0045\u0072\u0072\u006f\u0072\u0020\u006d\u0065\u0073\u0073\u0061\u0067\u0065\u003a\u0025\u0073
\u4e0a\u4f20\u0050\u0074\u0079\u004f\u0066\u0043\u006f\u006e\u0073\u006f\u006c\u0065\u0020\u0072\u0065\u006d\u006f\u0074\u0065\u0046\u0069\u006c\u0065\u002d\u003e\u0025\u0073=\u0055\u0070\u006c\u006f\u0061\u0064\u0050\u0074\u0079\u004f\u0066\u0043\u006f\u006e\u0073\u006f\u006c\u0065\u0020\u0072\u0065\u006d\u006f\u0074\u0065\u0046\u0069\u006c\u0065\u002d\u003e\u0025\u0073
\u590d\u5236\u9009\u4e2d=\u0043\u006f\u0070\u0079\u0020\u0073\u0065\u006c\u0065\u0063\u0074\u0065\u0064
\u65b0\u5efa\u6587\u4ef6\u5939\u6210\u529f=\u004e\u0065\u0077\u0020\u0066\u006f\u006c\u0064\u0065\u0072\u0020\u0063\u0072\u0065\u0061\u0074\u0065\u0064\u0020\u0073\u0075\u0063\u0063\u0065\u0073\u0073\u0066\u0075\u006c\u006c\u0079
\u5728\u65b0\u7a97\u53e3\u663e\u793a\u56fe\u7247=\u0053\u0068\u006f\u0077\u0020\u0069\u006d\u0061\u0067\u0065\u0020\u0069\u006e\u0020\u006e\u0065\u0077\u0020\u0077\u0069\u006e\u0064\u006f\u0077
\u6dfb\u52a0\u6210\u529f=\u0041\u0064\u0064\u0065\u0064\u0020\u0073\u0075\u0063\u0063\u0065\u0073\u0073\u0066\u0075\u006c\u006c\u0079
\u5df2\u6709\u7ec8\u7aef\u5728\u8fd0\u884c\u0020\u65e0\u6cd5\u518d\u6b21\u5f00\u542f=\u0054\u0065\u0072\u006d\u0069\u006e\u0061\u006c\u0020\u0061\u006c\u0072\u0065\u0061\u0064\u0079\u0020\u0072\u0075\u006e\u006e\u0069\u006e\u0067\u0020\u0043\u0061\u006e\u006e\u006f\u0074\u0020\u006f\u0070\u0065\u006e\u0020\u0061\u0067\u0061\u0069\u006e
\u0061\u0064\u0064\u0072\u0065\u0073\u0073\u003a\u0025\u0073\u0020\u0070\u006f\u0072\u0074\u003a\u0025\u0073\u0020\u8ba4\u8bc1\u65b9\u6cd5\u6570\u91cf\u003a\u0020\u0025\u0064=\u0061\u0064\u0064\u0072\u0065\u0073\u0073\u003a\u0025\u0073\u0020\u0070\u006f\u0072\u0074\u003a\u0025\u0073\u0020\u004e\u0075\u006d\u0062\u0065\u0072\u0020\u006f\u0066\u0020\u0061\u0075\u0074\u0068\u0065\u006e\u0074\u0069\u0063\u0061\u0074\u0069\u006f\u006e\u0020\u006d\u0065\u0074\u0068\u006f\u0064\u0073\u003a\u0020\u0025\u0064
\u65e0\u6cd5\u8fdb\u884c\u901a\u4fe1\u0020\u8bf7\u68c0\u67e5\u670d\u52a1\u662f\u5426\u542f\u52a8\u0020\u7f51\u7edc\u662f\u5426\u7545\u901a\u0021=\u0055\u006e\u0061\u0062\u006c\u0065\u0020\u0074\u006f\u0020\u0063\u006f\u006d\u006d\u0075\u006e\u0069\u0063\u0061\u0074\u0065\u0020\u0050\u006c\u0065\u0061\u0073\u0065\u0020\u0063\u0068\u0065\u0063\u006b\u0020\u0069\u0066\u0020\u0074\u0068\u0065\u0020\u0073\u0065\u0072\u0076\u0069\u0063\u0065\u0020\u0069\u0073\u0020\u0073\u0074\u0061\u0072\u0074\u0065\u0064\u0020\u0061\u006e\u0064\u0020\u0069\u0066\u0020\u0074\u0068\u0065\u0020\u006e\u0065\u0074\u0077\u006f\u0072\u006b\u0020\u0069\u0073\u0020\u0077\u006f\u0072\u006b\u0069\u006e\u0067\u0021
\u6b63\u5728\u626b\u63cf\u0020\u0068\u006f\u0073\u0074\u003a\u0025\u0073\u0020\u0070\u006f\u0072\u0074\u0073\u003a\u0025\u0073=\u0053\u0063\u0061\u006e\u006e\u0069\u006e\u0067\u0020\u0068\u006f\u0073\u0074\u003a\u0025\u0073\u0020\u0070\u006f\u0072\u0074\u0073\u003a\u0025\u0073
\u662f\u5426\u5f00\u542f\u64cd\u4f5c\u7f13\u5b58\u0020\u5982\u6587\u4ef6\u7f13\u5b58\u0020\u547d\u4ee4\u6267\u884c\u7f13\u5b58=\u0049\u0073\u0020\u006f\u0070\u0065\u0072\u0061\u0074\u0069\u006f\u006e\u0020\u0063\u0061\u0063\u0068\u0069\u006e\u0067\u0020\u0065\u006e\u0061\u0062\u006c\u0065\u0064\u002c\u0020\u0065\u002e\u0067\u002e\u0020\u0066\u0069\u006c\u0065\u0020\u0063\u0061\u0063\u0068\u0069\u006e\u0067\u0020\u0043\u006f\u006d\u006d\u0061\u006e\u0064\u0020\u0065\u0078\u0065\u0063\u0075\u0074\u0069\u006f\u006e\u0020\u0063\u0061\u0063\u0068\u0069\u006e\u0067
\u7f13\u5b58\u6587\u4ef6\u4e0d\u5b58\u5728=\u0043\u0061\u0063\u0068\u0065\u0020\u0066\u0069\u006c\u0065\u0020\u0064\u006f\u0065\u0073\u0020\u006e\u006f\u0074\u0020\u0065\u0078\u0069\u0073\u0074
\u89e3\u538b=\u0044\u0065\u0063\u006f\u006d\u0070\u0072\u0065\u0073\u0073\u0069\u006f\u006e
\u968f\u673a\u0055\u0061\u003a=\u0052\u0061\u006e\u0064\u006f\u006d\u0020\u0055\u0061\u003a
\u5df2\u7ecf\u590d\u5236\u5230\u526a\u8f91\u7248=\u0041\u006c\u0072\u0065\u0061\u0064\u0079\u0020\u0063\u006f\u0070\u0069\u0065\u0064\u0020\u0074\u006f\u0020\u0063\u006c\u0069\u0070\u0020\u0076\u0065\u0072\u0073\u0069\u006f\u006e
\u4fe1\u9053\u91cd\u590d\u5b9a\u4e49\u0020\u5df2\u6709\u0025\u0073\u0020\u91cd\u590d\u0025\u0073=\u0043\u0068\u0061\u006e\u006e\u0065\u006c\u0020\u0064\u0075\u0070\u006c\u0069\u0063\u0061\u0074\u0065\u0020\u0064\u0065\u0066\u0069\u006e\u0069\u0074\u0069\u006f\u006e\u0020\u0041\u006c\u0072\u0065\u0061\u0064\u0079\u0020\u0025\u0073\u0020\u0064\u0075\u0070\u006c\u0069\u0063\u0061\u0074\u0065\u0020\u0025\u0073
\u672a\u5b9a\u4e49\u7684\u679a\u4e3e\u9879=\u0055\u006e\u0064\u0065\u0066\u0069\u006e\u0065\u0064\u0020\u0065\u006e\u0075\u006d\u0065\u0072\u0061\u0074\u0069\u006f\u006e\u0020\u0069\u0074\u0065\u006d\u0073
\u5173\u95ed\u5de6\u8fb9\u6240\u6709=\u0043\u006c\u006f\u0073\u0065\u0020\u0061\u006c\u006c\u0020\u006c\u0065\u0066\u0074
\u8fd4\u56de\u0043\u006f\u006f\u006b\u0069\u0065=\u0052\u0065\u0074\u0075\u0072\u006e\u0020\u0043\u006f\u006f\u006b\u0069\u0065
\u672a\u9009\u4e2d\u7ec4\u0021=\u0047\u0072\u006f\u0075\u0070\u0020\u006e\u006f\u0074\u0020\u0073\u0065\u006c\u0065\u0063\u0074\u0065\u0064\u0021
\u5173\u95ed\u5931\u8d25\u0021=\u0043\u006c\u006f\u0073\u0065\u0020\u0066\u0061\u0069\u006c\u0065\u0064\u0021
\u6dfb\u52a0\u4ee3\u7406\u7c7b\u578b=\u0041\u0064\u0064\u0020\u0070\u0072\u006f\u0078\u0079\u0020\u0074\u0079\u0070\u0065
\u4e0a\u4f20\u0057\u0069\u006e\u0070\u0074\u0079\u63d2\u4ef6\u5931\u8d25=\u0046\u0061\u0069\u006c\u0065\u0064\u0020\u0074\u006f\u0020\u0075\u0070\u006c\u006f\u0061\u0064\u0020\u0057\u0069\u006e\u0070\u0074\u0079\u0020\u0070\u006c\u0075\u0067\u0069\u006e
\u5220\u9664\u6210\u529f=\u0044\u0065\u006c\u0065\u0074\u0065\u0020\u0073\u0075\u0063\u0063\u0065\u0073\u0073\u0066\u0075\u006c
\u4e0a\u4f20\u5931\u8d25=\u0046\u0061\u0069\u006c\u0065\u0064\u0020\u0074\u006f\u0020\u0075\u0070\u006c\u006f\u0061\u0064
\u672a\u80fd\u521b\u5efa\u0052\u0065\u0061\u006c\u0043\u006d\u0064\u670d\u52a1=\u0046\u0061\u0069\u006c\u0065\u0064\u0020\u0074\u006f\u0020\u0063\u0072\u0065\u0061\u0074\u0065\u0020\u0052\u0065\u0061\u006c\u0043\u006d\u0064\u0020\u0073\u0065\u0072\u0076\u0069\u0063\u0065
\u4e0a\u4f20\u0073\u0068\u0065\u006c\u006c\u0068\u006f\u0073\u0074\u0020\u0061\u0067\u0065\u006e\u0074\u5931\u8d25=\u0046\u0061\u0069\u006c\u0065\u0064\u0020\u0074\u006f\u0020\u0075\u0070\u006c\u006f\u0061\u0064\u0020\u0073\u0068\u0065\u006c\u006c\u0068\u006f\u0073\u0074\u0020\u0061\u0067\u0065\u006e\u0074
\u0053\u0065\u0072\u0076\u0065\u0072\u5957\u63a5\u5b57\u5355\u6b21\u8bfb\u53d6\u5927\u5c0f\u003a=\u0053\u0065\u0072\u0076\u0065\u0072\u0020\u0073\u006f\u0063\u006b\u0065\u0074\u0020\u0073\u0069\u006e\u0067\u006c\u0065\u0020\u0072\u0065\u0061\u0064\u0020\u0073\u0069\u007a\u0065\u003a
\u0073\u006f\u0063\u006b\u0073\u4ee3\u7406\u5df2\u542f\u52a8\u0021=\u0073\u006f\u0063\u006b\u0073\u0020\u0061\u0067\u0065\u006e\u0074\u0020\u0073\u0074\u0061\u0072\u0074\u0065\u0064\u0021
\u76ee\u6807\u8fd4\u56de\u5f02\u5e38\u002c\u65e0\u6cd5\u6b63\u5e38\u683c\u5f0f\u5316\u6570\u636e\u0021=\u0054\u0061\u0072\u0067\u0065\u0074\u0020\u0072\u0065\u0074\u0075\u0072\u006e\u0065\u0064\u0020\u0061\u006e\u0020\u0065\u0078\u0063\u0065\u0070\u0074\u0069\u006f\u006e\u002c\u0020\u0075\u006e\u0061\u0062\u006c\u0065\u0020\u0074\u006f\u0020\u0066\u006f\u0072\u006d\u0061\u0074\u0020\u0064\u0061\u0074\u0061\u0020\u0070\u0072\u006f\u0070\u0065\u0072\u006c\u0079\u0021
\u5237\u65b0=\u0052\u0065\u0066\u0072\u0065\u0073\u0068
\u5927\u6587\u4ef6\u4e0a\u4f20\u5f00\u59cb\u0020\u0073\u0072\u0063\u003a\u0025\u0073\u0020\u0064\u0065\u0073\u0074\u003a\u0025\u0073\u0020\u6587\u4ef6\u5927\u5c0f\u003a\u0025\u0064\u0020\u4e0a\u4f20\u5927\u5c0f\u003a\u0025\u0064=\u004c\u0061\u0072\u0067\u0065\u0020\u0066\u0069\u006c\u0065\u0020\u0075\u0070\u006c\u006f\u0061\u0064\u0020\u0073\u0074\u0061\u0072\u0074\u0065\u0064\u0020\u0073\u0072\u0063\u003a\u0025\u0073\u0020\u0064\u0065\u0073\u0074\u003a\u0025\u0073\u0020\u0066\u0069\u006c\u0065\u0020\u0073\u0069\u007a\u0065\u003a\u0025\u0064\u0020\u0075\u0070\u006c\u006f\u0061\u0064\u0020\u0073\u0069\u007a\u0065\u003a\u0025\u0064
\u547d\u4ee4\u6a21\u677f=\u0043\u006f\u006d\u006d\u0061\u006e\u0064\u0020\u0054\u0065\u006d\u0070\u006c\u0061\u0074\u0065
\u6587\u4ef6\u8def\u5f84\u003a=\u0046\u0069\u006c\u0065\u0020\u0070\u0061\u0074\u0068\u003a
\u4e0a\u4f20=\u0055\u0070\u006c\u006f\u0061\u0064
\u5173\u95ed\u5176\u5b83=\u0043\u006c\u006f\u0073\u0065\u0020\u006f\u0074\u0068\u0065\u0072
\u6dfb\u52a0\u5931\u8d25\u0020\u8bf7\u68c0\u67e5\u7ec4\u662f\u5426\u5b58\u5728\u0020\u63a7\u5236\u53f0\u662f\u5426\u6709\u62a5\u9519\u0021=\u0046\u0061\u0069\u006c\u0065\u0064\u0020\u0074\u006f\u0020\u0061\u0064\u0064\u0020\u0050\u006c\u0065\u0061\u0073\u0065\u0020\u0063\u0068\u0065\u0063\u006b\u0020\u0069\u0066\u0020\u0074\u0068\u0065\u0020\u0063\u0068\u0065\u0063\u006b\u006c\u0069\u0073\u0074\u0020\u0065\u0078\u0069\u0073\u0074\u0073\u0020\u0043\u006f\u006e\u0073\u006f\u006c\u0065\u0020\u0069\u0073\u0020\u0072\u0065\u0070\u006f\u0072\u0074\u0069\u006e\u0067\u0020\u0061\u006e\u0020\u0065\u0072\u0072\u006f\u0072\u0021
\u7ec8\u7aef\u914d\u8272\u003a=\u0054\u0065\u0072\u006d\u0069\u006e\u0061\u006c\u0020\u0063\u006f\u006c\u006f\u0075\u0072\u0020\u0073\u0063\u0068\u0065\u006d\u0065\u003a
\u679a\u4e3e\u6570\u636e\u5e93\u4fe1\u606f=\u0045\u006e\u0075\u006d\u0065\u0072\u0061\u0074\u0065\u0020\u0064\u0061\u0074\u0061\u0062\u0061\u0073\u0065\u0020\u0069\u006e\u0066\u006f\u0072\u006d\u0061\u0074\u0069\u006f\u006e
\u53ea\u652f\u6301\u8fdc\u7a0b\u6ce8\u5165\u0021\u0021\u0021=\u004f\u006e\u006c\u0079\u0020\u0072\u0065\u006d\u006f\u0074\u0065\u0020\u0069\u006e\u006a\u0065\u0063\u0074\u0069\u006f\u006e\u0020\u0069\u0073\u0020\u0073\u0075\u0070\u0070\u006f\u0072\u0074\u0065\u0064\u0021\u0021\u0021
\u5728\u65b0\u7a97\u53e3\u7f16\u8f91\u6587\u4ef6=\u0045\u0064\u0069\u0074\u0020\u0066\u0069\u006c\u0065\u0020\u0069\u006e\u0020\u006e\u0065\u0077\u0020\u0077\u0069\u006e\u0064\u006f\u0077
\u65b0\u7248\u672c\u5df2\u7ecf\u53d1\u5e03\u005c\u006e\u5f53\u524d\u7248\u672c\u003a\u0025\u0073\u005c\u006e\u6700\u65b0\u7248\u672c\u003a\u0025\u0073=\u004e\u0065\u0077\u0020\u0076\u0065\u0072\u0073\u0069\u006f\u006e\u0020\u0068\u0061\u0073\u0020\u0062\u0065\u0065\u006e\u0020\u0072\u0065\u006c\u0065\u0061\u0073\u0065\u0064\u0020\u005c\u006e\u0043\u0075\u0072\u0072\u0065\u006e\u0074\u0020\u0076\u0065\u0072\u0073\u0069\u006f\u006e\u003a\u0025\u0073\u005c\u006e\u004c\u0061\u0074\u0065\u0073\u0074\u0020\u0076\u0065\u0072\u0073\u0069\u006f\u006e\u003a\u0025\u0073
\u662f\u5426\u5f00\u542f\u8be6\u7ec6\u65e5\u5fd7=\u0057\u0068\u0065\u0074\u0068\u0065\u0072\u0020\u0074\u006f\u0020\u0065\u006e\u0061\u0062\u006c\u0065\u0020\u0064\u0065\u0074\u0061\u0069\u006c\u0065\u0064\u0020\u006c\u006f\u0067\u0067\u0069\u006e\u0067
\u8bf7\u6c42\u6296\u52a8\u5ef6\u65f6\u0028\u006d\u0073\u0029=\u0052\u0065\u0071\u0075\u0065\u0073\u0074\u0020\u006a\u0069\u0074\u0074\u0065\u0072\u0020\u0064\u0065\u006c\u0061\u0079\u0020\u0028\u006d\u0073\u0029
\u7c7b\u578b=\u0054\u0079\u0070\u0065
\u683c\u5f0f\u4e0d\u5339\u914d\u0020\u002c=\u0046\u006f\u0072\u006d\u0061\u0074\u0020\u0064\u006f\u0065\u0073\u0020\u006e\u006f\u0074\u0020\u006d\u0061\u0074\u0063\u0068\u0020\u002c
\u6b63\u5728\u542f\u52a8\u0021=\u0069\u0073\u0020\u0073\u0074\u0061\u0072\u0074\u0069\u006e\u0067\u0021
\u662f\u5426\u5f00\u542f\u4e0a\u5e1d\u6a21\u5f0f=\u0057\u0068\u0065\u0074\u0068\u0065\u0072\u0020\u0074\u006f\u0020\u0074\u0075\u0072\u006e\u0020\u006f\u006e\u0020\u0047\u006f\u0064\u0020\u004d\u006f\u0064\u0065
\u6ca1\u6709\u9009\u4e2d\u63d2\u4ef6=\u004e\u006f\u0020\u0070\u006c\u0075\u0067\u0069\u006e\u0020\u0073\u0065\u006c\u0065\u0063\u0074\u0065\u0064
\u0052\u0065\u0071\u0075\u0065\u0073\u0074\u914d\u7f6e=\u0052\u0065\u0071\u0075\u0065\u0073\u0074\u0020\u0063\u006f\u006e\u0066\u0069\u0067\u0075\u0072\u0061\u0074\u0069\u006f\u006e
\u65b0\u5efa\u6587\u4ef6\u5939\u5931\u8d25=\u0046\u0061\u0069\u006c\u0065\u0064\u0020\u0074\u006f\u0020\u0063\u0072\u0065\u0061\u0074\u0065\u0020\u0061\u0020\u006e\u0065\u0077\u0020\u0066\u006f\u006c\u0064\u0065\u0072
\u8fd4\u56de\u534f\u8bae\u5934=\u0052\u0065\u0074\u0075\u0072\u006e\u0020\u0070\u0072\u006f\u0074\u006f\u0063\u006f\u006c\u0020\u0068\u0065\u0061\u0064\u0065\u0072
\u8df3\u5305\u6296\u52a8\u0020\u767e\u5206\u6bd4=\u004a\u0075\u006d\u0070\u0020\u0070\u0061\u0063\u006b\u0065\u0074\u0020\u006a\u0069\u0074\u0074\u0065\u0072\u0020\u0050\u0065\u0072\u0063\u0065\u006e\u0074\u0061\u0067\u0065
\u5173\u95ed\u53f3\u8fb9\u6240\u6709=\u0043\u006c\u006f\u0073\u0065\u0020\u0061\u006c\u006c\u0020\u006f\u006e\u0020\u0074\u0068\u0065\u0020\u0072\u0069\u0067\u0068\u0074
\u005a\u0049\u0050\u538b\u7f29=\u005a\u0049\u0050\u0020\u0063\u006f\u006d\u0070\u0072\u0065\u0073\u0073\u0069\u006f\u006e
\u590d\u5236\u6210\u529f=\u0043\u006f\u0070\u0079\u0020\u0073\u0075\u0063\u0063\u0065\u0073\u0073\u0066\u0075\u006c
\u79fb\u52a8\u6210\u529f\u0020\u0020\u0025\u0073\u0020\u003e\u003e\u0020\u0025\u0073=\u004d\u006f\u0076\u0065\u0020\u0073\u0075\u0063\u0063\u0065\u0073\u0073\u0066\u0075\u006c\u0020\u0025\u0073\u0020\u003e\u003e\u0020\u0025\u0073
\u5927\u6587\u4ef6\u4e0b\u8f7d\u5931\u8d25\u0020\u6587\u4ef6\u4e0d\u5b58\u5728\u6216\u8005\u65e0\u6cd5\u8bbf\u95ee=\u004c\u0061\u0072\u0067\u0065\u0020\u0066\u0069\u006c\u0065\u0020\u0064\u006f\u0077\u006e\u006c\u006f\u0061\u0064\u0020\u0066\u0061\u0069\u006c\u0065\u0064\u0020\u0046\u0069\u006c\u0065\u0020\u0064\u006f\u0065\u0073\u0020\u006e\u006f\u0074\u0020\u0065\u0078\u0069\u0073\u0074\u0020\u006f\u0072\u0020\u0063\u0061\u006e\u006e\u006f\u0074\u0020\u0062\u0065\u0020\u0061\u0063\u0063\u0065\u0073\u0073\u0065\u0064
\u521d\u59cb\u5316\u5931\u8d25=\u0049\u006e\u0069\u0074\u0069\u0061\u006c\u0069\u007a\u0061\u0074\u0069\u006f\u006e\u0020\u0066\u0061\u0069\u006c\u0065\u0064
\u4ee3\u7406\u7c7b\u578b=\u0050\u0072\u006f\u0078\u0079\u0020\u0074\u0079\u0070\u0065
\u5df2\u5173\u95ed\u0021=\u0044\u0069\u0073\u0061\u0062\u006c\u0065\u0064\u0021
\u79fb\u9664\u63d2\u4ef6\u6210\u529f=\u0052\u0065\u006d\u006f\u0076\u0061\u006c\u0020\u006f\u0066\u0020\u0070\u006c\u0075\u0067\u0069\u006e\u0020\u0073\u0075\u0063\u0063\u0065\u0073\u0073\u0066\u0075\u006c
\u5bc6\u7801\u6216\u5bc6\u94a5\u662f\u7a7a\u7684=\u0050\u0061\u0073\u0073\u0077\u006f\u0072\u0064\u0020\u006f\u0072\u0020\u006b\u0065\u0079\u0020\u0069\u0073\u0020\u0065\u006d\u0070\u0074\u0079
\u63d2\u4ef6\u914d\u7f6e=\u0050\u006c\u0075\u0067\u0069\u006e\u0020\u0063\u006f\u006e\u0066\u0069\u0067\u0075\u0072\u0061\u0074\u0069\u006f\u006e
\u67e0\u6aac=\u004c\u0065\u006d\u006f\u006e
\u590d\u5236=\u0043\u006f\u0070\u0079
\u0052\u0065\u0073\u0070\u006f\u006e\u0073\u0065\u914d\u7f6e=\u0052\u0065\u0073\u0070\u006f\u006e\u0073\u0065\u0020\u0063\u006f\u006e\u0066\u0069\u0067\u0075\u0072\u0061\u0074\u0069\u006f\u006e
\u006d\u0069\u0072\u0072\u006f\u0072\u0053\u006f\u0063\u006b\u0065\u0074\u0020\u542f\u52a8\u5931\u8d25\u53ef\u80fd\u662f\u5730\u5740\u002f\u7aef\u53e3\u5df2\u88ab\u5360\u7528\u0020\u0065\u0072\u0072\u004d\u0073\u0067\u003a\u0025\u0073=\u006d\u0069\u0072\u0072\u006f\u0072\u0053\u006f\u0063\u006b\u0065\u0074\u0020\u0073\u0074\u0061\u0072\u0074\u0075\u0070\u0020\u0066\u0061\u0069\u006c\u0065\u0064\u0020\u0070\u0072\u006f\u0062\u0061\u0062\u006c\u0079\u0020\u0062\u0065\u0063\u0061\u0075\u0073\u0065\u0020\u0074\u0068\u0065\u0020\u0061\u0064\u0064\u0072\u0065\u0073\u0073\u002f\u0070\u006f\u0072\u0074\u0020\u0069\u0073\u0020\u0061\u006c\u0072\u0065\u0061\u0064\u0079\u0020\u006f\u0063\u0063\u0075\u0070\u0069\u0065\u0064\u0020\u0065\u0072\u0072\u004d\u0073\u0067\u003a\u0025\u0073
\u5b57\u4f53\u7c7b\u578b\u0020\u003a=\u0046\u006f\u006e\u0074\u0020\u0074\u0079\u0070\u0065\u0020\u003a
\u626b\u63cf=\u0053\u0063\u0061\u006e
\u6267\u884c=\u0045\u0078\u0065\u0063\u0075\u0074\u0065
\u8fdc\u7a0b\u4e0b\u8f7d\u6210\u529f=\u0052\u0065\u006d\u006f\u0074\u0065\u0020\u0064\u006f\u0077\u006e\u006c\u006f\u0061\u0064\u0020\u0073\u0075\u0063\u0063\u0065\u0073\u0073\u0066\u0075\u006c
\u5220\u9664\u5931\u8d25=\u0046\u0061\u0069\u006c\u0065\u0064\u0020\u0074\u006f\u0020\u0064\u0065\u006c\u0065\u0074\u0065
\u7528\u6237\u53d6\u6d88\u9009\u62e9\u002e\u002e\u002e\u002e\u002e=\u0055\u0073\u0065\u0072\u0020\u0064\u0065\u0073\u0065\u006c\u0065\u0063\u0074\u0065\u0064\u0020\u002e\u002e\u002e\u002e\u002e
\u5df2\u5220\u9664\u0021=\u0044\u0065\u006c\u0065\u0074\u0065\u0064\u0021
\u0068\u006f\u0073\u0074\u002f\u0070\u006f\u0072\u0074\u0073\u0020\u662f\u7a7a\u7684=\u0068\u006f\u0073\u0074\u002f\u0070\u006f\u0072\u0074\u0073\u0020\u0069\u0073\u0020\u0065\u006d\u0070\u0074\u0079
\u5b57\u4f53\u5927\u5c0f\u0020\u003a=\u0046\u006f\u006e\u0074\u0020\u0073\u0069\u007a\u0065\u0020\u003a
\u76ee\u6807=\u0054\u0061\u0072\u0067\u0065\u0074
\u4e0b\u8f7d=\u0044\u006f\u0077\u006e\u006c\u006f\u0061\u0064
\u0073\u006f\u0063\u006b\u0073\u0034\u0061\u002f\u0035\u0020\u7ed1\u5b9a\u7aef\u53e3\u003a=\u0073\u006f\u0063\u006b\u0073\u0034\u0061\u002f\u0035\u0020\u0062\u0069\u006e\u0064\u0020\u0070\u006f\u0072\u0074\u003a
\u8bf7\u6c42\u0055\u0052\u0049\u53c2\u6570=\u0052\u0065\u0071\u0075\u0065\u0073\u0074\u0020\u0055\u0052\u0049\u0020\u0070\u0061\u0072\u0061\u006d\u0065\u0074\u0065\u0072\u0073
\u0043\u006c\u0069\u0065\u006e\u0074\u5355\u6b21\u8bfb\u53d6\u5927\u5c0f\u003a=\u0043\u006c\u0069\u0065\u006e\u0074\u0020\u0073\u0069\u006e\u0067\u006c\u0065\u0020\u0072\u0065\u0061\u0064\u0020\u0073\u0069\u007a\u0065\u003a
\u4e0b\u4e2a\u7248\u672c\u5f00\u653e=\u004f\u0070\u0065\u006e\u0020\u0069\u006e\u0020\u006e\u0065\u0078\u0074\u0020\u0076\u0065\u0072\u0073\u0069\u006f\u006e
\u672a\u9009\u4e2d\u5217=\u0055\u006e\u0063\u0068\u0065\u0063\u006b\u0065\u0064\u0020\u0063\u006f\u006c\u0075\u006d\u006e
\u6b63\u5728\u6267\u884c\u002e\u002e\u002e\u8bf7\u7a0d\u7b49=\u0045\u0078\u0065\u0063\u0075\u0074\u0069\u006e\u0067\u002e\u002e\u002e\u0020\u0050\u006c\u0065\u0061\u0073\u0065\u0020\u0077\u0061\u0069\u0074
\u672a\u627e\u5230\u0050\u0079\u0074\u0068\u006f\u006e\u89e3\u91ca\u5668\u0020\u6b63\u5728\u4e0a\u4f20\u006c\u0069\u006e\u0075\u0078\u0050\u0074\u0079\u0020\u0020\u0052\u0065\u006d\u006f\u0074\u0065\u0046\u0069\u006c\u0065\u002d\u003e\u0025\u0073=\u0050\u0079\u0074\u0068\u006f\u006e\u0020\u0069\u006e\u0074\u0065\u0072\u0070\u0072\u0065\u0074\u0065\u0072\u0020\u006e\u006f\u0074\u0020\u0066\u006f\u0075\u006e\u0064\u0020\u0055\u0070\u006c\u006f\u0061\u0064\u0069\u006e\u0067\u0020\u006c\u0069\u006e\u0075\u0078\u0050\u0074\u0079\u0020\u0052\u0065\u006d\u006f\u0074\u0065\u0046\u0069\u006c\u0065\u002d\u003e\u0025\u0073
\u5173\u95ed\u5f53\u524d=\u0043\u006c\u006f\u0073\u0069\u006e\u0067\u0020\u0063\u0075\u0072\u0072\u0065\u006e\u0074
\u5927\u6587\u4ef6\u4e0a\u4f20\u7ed3\u675f\u0020\u0073\u0072\u0063\u003a\u0025\u0073\u0020\u0064\u0065\u0073\u0074\u003a\u0025\u0073\u0020\u6587\u4ef6\u5927\u5c0f\u003a\u0025\u0064\u0020\u4e0a\u4f20\u5927\u5c0f\u003a\u0025\u0064=\u0045\u006e\u0064\u0020\u006f\u0066\u0020\u006c\u0061\u0072\u0067\u0065\u0020\u0066\u0069\u006c\u0065\u0020\u0075\u0070\u006c\u006f\u0061\u0064\u0020\u0073\u0072\u0063\u003a\u0025\u0073\u0020\u0064\u0065\u0073\u0074\u003a\u0025\u0073\u0020\u0066\u0069\u006c\u0065\u0020\u0073\u0069\u007a\u0065\u003a\u0025\u0064\u0020\u0075\u0070\u006c\u006f\u0061\u0064\u0020\u0073\u0069\u007a\u0065\u003a\u0025\u0064
\u5220\u9664\u5f53\u524d\u7ec4=\u0044\u0065\u006c\u0065\u0074\u0065\u0020\u0063\u0075\u0072\u0072\u0065\u006e\u0074\u0020\u0067\u0072\u006f\u0075\u0070
\u914d\u7f6e\u4ee3\u7406=\u0043\u006f\u006e\u0066\u0069\u0067\u0075\u0072\u0065\u0020\u0070\u0072\u006f\u0078\u0079
\u5df2\u5f00\u542f\u7ec8\u7aef\u8bf7\u4f7f\u7528\u006e\u0065\u0074\u0063\u0061\u0074\u8fde\u63a5\u0068\u006f\u0073\u0074\u003a\u0025\u0073\u002c\u0070\u006f\u0072\u0074\u003a\u0025\u0073=\u004f\u0070\u0065\u006e\u0065\u0064\u0020\u0074\u0065\u0072\u006d\u0069\u006e\u0061\u006c\u0020\u0070\u006c\u0065\u0061\u0073\u0065\u0020\u0075\u0073\u0065\u0020\u006e\u0065\u0074\u0063\u0061\u0074\u0020\u0074\u006f\u0020\u0063\u006f\u006e\u006e\u0065\u0063\u0074\u0020\u0074\u006f\u0020\u0068\u006f\u0073\u0074\u003a\u0025\u0073\u002c\u0070\u006f\u0072\u0074\u003a\u0025\u0073
\u4ec5\u663e\u793a\u5f00\u653e\u7aef\u53e3\u003a=\u0053\u0068\u006f\u0077\u0020\u006f\u006e\u006c\u0079\u0020\u006f\u0070\u0065\u006e\u0020\u0070\u006f\u0072\u0074\u0073\u003a
\u4fee\u6539=\u004d\u006f\u0064\u0069\u0066\u0079
\u4fee\u6539\u6210\u529f=\u004d\u006f\u0064\u0069\u0066\u0069\u0065\u0064\u0020\u0073\u0075\u0063\u0063\u0065\u0073\u0073\u0066\u0075\u006c\u006c\u0079
\u52a0\u8f7d\u0047\u006f\u0064\u007a\u0069\u006c\u006c\u0061\u004a\u006e\u0061\u5931\u8d25=\u004c\u006f\u0061\u0064\u0069\u006e\u0067\u0020\u0047\u006f\u0064\u007a\u0069\u006c\u006c\u0061\u004a\u006e\u0061\u0020\u0066\u0061\u0069\u006c\u0065\u0064
\u6dfb\u52a0\u63d2\u4ef6\u6210\u529f=\u0041\u0064\u0064\u0069\u006e\u0067\u0020\u0074\u0068\u0065\u0020\u0070\u006c\u0075\u0067\u0069\u006e\u0020\u0077\u0061\u0073\u0020\u0073\u0075\u0063\u0063\u0065\u0073\u0073\u0066\u0075\u006c
\u8fd0\u884c\u6a21\u5f0f\u003a=\u0052\u0075\u006e\u0020\u006d\u006f\u0064\u0065\u003a
\u4fdd\u5b58=\u0053\u0061\u0076\u0065
\u5bc6\u94a5\u003a=\u004b\u0065\u0079\u003a
\u7b14\u8bb0=\u004e\u006f\u0074\u0065\u0073
\u6570\u636e\u5e93\u7528\u6237\u540d=\u0044\u0061\u0074\u0061\u0062\u0061\u0073\u0065\u0020\u0055\u0073\u0065\u0072\u006e\u0061\u006d\u0065
\u8fdc\u7a0b\u0053\u006f\u0063\u006b\u0073\u0020\u52a0\u5bc6\u004b\u0065\u0079\u003a=\u0052\u0065\u006d\u006f\u0074\u0065\u0020\u0053\u006f\u0063\u006b\u0073\u0020\u0045\u006e\u0063\u0072\u0079\u0070\u0074\u0069\u006f\u006e\u0020\u004b\u0065\u0079\u003a
\u0073\u006f\u0063\u006b\u0073\u4ee3\u7406\u542f\u52a8\u5931\u8d25\u0021=\u0073\u006f\u0063\u006b\u0073\u0020\u0070\u0072\u006f\u0078\u0079\u0020\u0066\u0061\u0069\u006c\u0065\u0064\u0020\u0074\u006f\u0020\u0073\u0074\u0061\u0072\u0074\u0021
\u6548\u9a8c\u0048\u0061\u0073\u0068\u6210\u529f\u0020\u0020\u0020\u0048\u0061\u0073\u0068\u0020\u0055\u0072\u006c\u003a\u0025\u0073\u005c\u0072\u005c\u006e\u6548\u9a8c\u004a\u0061\u0072\u54c8\u5e0c\u003a\u0025\u0073\u005c\u0072\u005c\u006e\u672c\u5730\u004a\u0061\u0072\u54c8\u5e0c\u003a\u0025\u0073=\u0056\u0061\u006c\u0069\u0064\u0061\u0074\u0069\u006f\u006e\u0020\u0048\u0061\u0073\u0068\u0020\u0053\u0075\u0063\u0063\u0065\u0073\u0073\u0066\u0075\u006c\u0020\u0048\u0061\u0073\u0068\u0020\u0055\u0072\u006c\u003a\u0025\u0073\u005c\u0072\u005c\u006e\u0020\u0056\u0061\u006c\u0069\u0064\u0061\u0074\u0069\u006f\u006e\u0020\u004a\u0061\u0072\u0020\u0048\u0061\u0073\u0068\u003a\u0025\u0073\u005c\u0072\u005c\u006e\u0020\u004c\u006f\u0063\u0061\u006c\u0020\u004a\u0061\u0072\u0020\u0048\u0061\u0073\u0068\u003a\u0025\u0073
\u7528\u6237\u53d6\u6d88\u9009\u62e9\u002e\u002e\u002e\u002e\u002e\u002e=\u0055\u0073\u0065\u0072\u0020\u0064\u0065\u0073\u0065\u006c\u0065\u0063\u0074\u0065\u0064\u0020\u002e\u002e\u002e\u002e\u002e\u002e
\u54cd\u5e94\u53f3\u8fb9\u8ffd\u52a0\u6570\u636e=\u0041\u0070\u0070\u0065\u006e\u0064\u0020\u0064\u0061\u0074\u0061\u0020\u0074\u006f\u0020\u0074\u0068\u0065\u0020\u0072\u0069\u0067\u0068\u0074\u0020\u006f\u0066\u0020\u0074\u0068\u0065\u0020\u0072\u0065\u0073\u0070\u006f\u006e\u0073\u0065
\u672a\u5b9e\u73b0=\u004e\u006f\u0074\u0020\u0061\u0063\u0068\u0069\u0065\u0076\u0065\u0064
\u5bfc\u51fa\u5931\u8d25=\u0045\u0078\u0070\u006f\u0072\u0074\u0020\u0066\u0061\u0069\u006c\u0065\u0064
\u5c4f\u5e55\u622a\u56fe=\u0053\u0063\u0072\u0065\u0065\u006e\u0073\u0068\u006f\u0074
\u672a\u9009\u4e2d\u6587\u4ef6\u8def\u5f84=\u0046\u0069\u006c\u0065\u0020\u0070\u0061\u0074\u0068\u0020\u006e\u006f\u0074\u0020\u0073\u0065\u006c\u0065\u0063\u0074\u0065\u0064
\u590d\u5236\u5931\u8d25=\u0043\u006f\u0070\u0079\u0020\u0066\u0061\u0069\u006c\u0065\u0064
\u6587\u4ef6\u4e0d\u5b58\u5728=\u0046\u0069\u006c\u0065\u0020\u0064\u006f\u0065\u0073\u0020\u006e\u006f\u0074\u0020\u0065\u0078\u0069\u0073\u0074
\u5171\u5220\u9664\u0025\u0073\u6761\u0053\u0068\u0065\u006c\u006c=\u0054\u006f\u0074\u0061\u006c\u0020\u0025\u0073\u0020\u006f\u0066\u0020\u0073\u0068\u0065\u006c\u006c\u0073\u0020\u0064\u0065\u006c\u0065\u0074\u0065\u0064
\u5220\u9664\u5931\u8d25\u0020\u8bf7\u68c0\u67e5\u7ec4\u662f\u5426\u5b58\u5728\u0020\u63a7\u5236\u53f0\u662f\u5426\u6709\u62a5\u9519\u0021=\u0046\u0061\u0069\u006c\u0065\u0064\u0020\u0074\u006f\u0020\u0064\u0065\u006c\u0065\u0074\u0065\u0020\u0050\u006c\u0065\u0061\u0073\u0065\u0020\u0063\u0068\u0065\u0063\u006b\u0020\u0069\u0066\u0020\u0074\u0068\u0065\u0020\u0066\u0069\u006c\u0065\u0020\u0065\u0078\u0069\u0073\u0074\u0073\u0020\u0044\u006f\u0065\u0073\u0020\u0074\u0068\u0065\u0020\u0063\u006f\u006e\u0073\u006f\u006c\u0065\u0020\u0072\u0065\u0070\u006f\u0072\u0074\u0020\u0061\u006e\u0020\u0065\u0072\u0072\u006f\u0072\u0021
\u4f60\u597d\u0020\u0068\u0065\u006c\u006c\u006f\u0020\u2764\u2764\u2764=\u0048\u0065\u006c\u006c\u006f\u0020\u0068\u0065\u006c\u006c\u006f\u0020\u2764\u2764\u2764\u2764\u2764
\u7f16\u8f91=\u0045\u0064\u0069\u0074
\u5185\u5b58\u0053\u0068\u0065\u006c\u006c=\u004d\u0065\u006d\u006f\u0072\u0079\u0020\u0053\u0068\u0065\u006c\u006c
\u54cd\u5e94\u72b6\u6001\u7801=\u0052\u0065\u0073\u0070\u006f\u006e\u0073\u0065\u0020\u0073\u0074\u0061\u0074\u0075\u0073\u0020\u0063\u006f\u0064\u0065
\u7528\u6237\u672a\u8f93\u5165\u6570\u636e=\u004e\u006f\u0020\u0064\u0061\u0074\u0061\u0020\u0065\u006e\u0074\u0065\u0072\u0065\u0064\u0020\u0062\u0079\u0020\u0075\u0073\u0065\u0072
\u4e0b\u8f7d\u8def\u5f84\u4e3a\u7a7a=\u0044\u006f\u0077\u006e\u006c\u006f\u0061\u0064\u0020\u0070\u0061\u0074\u0068\u0020\u0069\u0073\u0020\u0065\u006d\u0070\u0074\u0079
\u6d4b\u8bd5\u8fde\u63a5=\u0054\u0065\u0073\u0074\u0020\u0063\u006f\u006e\u006e\u0065\u0063\u0074\u0069\u006f\u006e
\u5173\u95ed\u6210\u529f\u0021=\u0053\u0068\u0075\u0074\u0064\u006f\u0077\u006e\u0020\u0073\u0075\u0063\u0063\u0065\u0073\u0073\u0066\u0075\u006c\u0021
\u76ee\u6807\u662f\u542f\u52a8\u72b6\u6001\u0020\u9700\u505c\u6b62\u670d\u52a1\u624d\u53ef\u8fdb\u884c\u5220\u9664\u0021=\u0054\u0061\u0072\u0067\u0065\u0074\u0020\u0069\u0073\u0020\u0075\u0070\u0020\u0061\u006e\u0064\u0020\u006e\u0065\u0065\u0064\u0073\u0020\u0074\u006f\u0020\u0062\u0065\u0020\u0073\u0074\u006f\u0070\u0070\u0065\u0064\u0020\u0062\u0065\u0066\u006f\u0072\u0065\u0020\u0064\u0065\u006c\u0065\u0074\u0069\u006f\u006e\u0020\u0063\u0061\u006e\u0020\u0074\u0061\u006b\u0065\u0020\u0070\u006c\u0061\u0063\u0065\u0021
\u52a0\u5bc6\u5668=\u0045\u006e\u0063\u0072\u0079\u0070\u0074\u006f\u0072
\u7f51\u7edc\u8be6\u60c5=\u004e\u0065\u0074\u0077\u006f\u0072\u006b\u0020\u0064\u0065\u0074\u0061\u0069\u006c\u0073
\u8fdc\u7a0b\u4e0b\u8f7d\u5931\u8d25=\u0052\u0065\u006d\u006f\u0074\u0065\u0020\u0064\u006f\u0077\u006e\u006c\u006f\u0061\u0064\u0020\u0066\u0061\u0069\u006c\u0065\u0064
\u5f53\u524d\u5b57\u4f53\u0020\u003a=\u0043\u0075\u0072\u0072\u0065\u006e\u0074\u0020\u0066\u006f\u006e\u0074\u0020\u003a
\u8bf7\u6c42\u9519\u8bef\u91cd\u8bd5\u6296\u52a8\u5ef6\u65f6\u0028\u006d\u0073\u0029=\u0052\u0065\u0071\u0075\u0065\u0073\u0074\u0020\u0065\u0072\u0072\u006f\u0072\u0020\u0072\u0065\u0074\u0072\u0079\u0020\u006a\u0069\u0074\u0074\u0065\u0072\u0020\u0064\u0065\u006c\u0061\u0079\u0020\u0028\u006d\u0073\u0029
\u672a\u80fd\u83b7\u53d6\u5230\u0053\u0065\u0073\u0073\u0069\u006f\u006e=\u0046\u0061\u0069\u006c\u0065\u0064\u0020\u0074\u006f\u0020\u0066\u0065\u0074\u0063\u0068\u0020\u0053\u0065\u0073\u0073\u0069\u006f\u006e
\u91cd\u7f6e=\u0052\u0065\u0073\u0065\u0074
\u6587\u4ef6\u4fee\u6539\u65f6\u95f4\u003a=\u0046\u0069\u006c\u0065\u0020\u006d\u006f\u0064\u0069\u0066\u0069\u0063\u0061\u0074\u0069\u006f\u006e\u0020\u0074\u0069\u006d\u0065\u003a
\u5220\u9664\u4ee3\u7406=\u0044\u0065\u006c\u0065\u0074\u0065\u0020\u0070\u0072\u006f\u0078\u0079
\u6838\u5fc3\u914d\u7f6e=\u0043\u006f\u0072\u0065\u0020\u0043\u006f\u006e\u0066\u0069\u0067\u0075\u0072\u0061\u0074\u0069\u006f\u006e
\u4fdd\u5b58\u6210\u529f=\u0053\u0061\u0076\u0065\u0064\u0020\u0073\u0075\u0063\u0063\u0065\u0073\u0073\u0066\u0075\u006c\u006c\u0079
\u6709\u6548\u8f7d\u8377=\u0050\u0061\u0079\u006c\u006f\u0061\u0064
\u968f\u673a\u0052\u0065\u0071\u0050\u0061\u0072\u0061\u006d\u0065\u0074\u0065\u0072\u003a=\u0052\u0061\u006e\u0064\u006f\u006d\u0020\u0052\u0065\u0071\u0050\u0061\u0072\u0061\u006d\u0065\u0074\u0065\u0072\u003a
\u6ce8\u5165\u8fdb\u7a0b\u6587\u4ef6\u003a=\u0049\u006e\u006a\u0065\u0063\u0074\u0065\u0064\u0020\u0069\u006e\u0074\u006f\u0020\u0070\u0072\u006f\u0063\u0065\u0073\u0073\u0020\u0066\u0069\u006c\u0065\u003a
\u63d0\u793a=\u0050\u0072\u006f\u006d\u0070\u0074
\u662f\u5426\u540c\u6b65\u8bf7\u6c42\u0020\u540c\u4e00\u65f6\u95f4\u53ea\u5141\u8bb8\u4e00\u4e2a\u0068\u0074\u0074\u0070\u8bf7\u6c42=\u0057\u0068\u0065\u0074\u0068\u0065\u0072\u0020\u0074\u006f\u0020\u0073\u0079\u006e\u0063\u0068\u0072\u006f\u006e\u0069\u007a\u0065\u0020\u0072\u0065\u0071\u0075\u0065\u0073\u0074\u0073\u0020\u004f\u006e\u006c\u0079\u0020\u006f\u006e\u0065\u0020\u0068\u0074\u0074\u0070\u0020\u0072\u0065\u0071\u0075\u0065\u0073\u0074\u0020\u0069\u0073\u0020\u0061\u006c\u006c\u006f\u0077\u0065\u0064\u0020\u0061\u0074\u0020\u0061\u0020\u0074\u0069\u006d\u0065
\u5df2\u5f3a\u5236\u5173\u95ed=\u0046\u006f\u0072\u0063\u0065\u0064\u0020\u0074\u006f\u0020\u0063\u006c\u006f\u0073\u0065
\u0053\u006f\u0063\u006b\u0073\u4ee3\u7406=\u0053\u006f\u0063\u006b\u0073\u0020\u0070\u0072\u006f\u0078\u0079
\u5927\u6587\u4ef6\u4e0a\u4f20\u7ed3\u675f\u0020\u6587\u4ef6\u5927\u5c0f\u003a\u0025\u0064\u0020\u4e0a\u4f20\u5927\u5c0f\u003a\u0025\u0064=\u0045\u006e\u0064\u0020\u006f\u0066\u0020\u006c\u0061\u0072\u0067\u0065\u0020\u0066\u0069\u006c\u0065\u0020\u0075\u0070\u006c\u006f\u0061\u0064\u0020\u0046\u0069\u006c\u0065\u0020\u0073\u0069\u007a\u0065\u003a\u0025\u0064\u0020\u0055\u0070\u006c\u006f\u0061\u0064\u0020\u0073\u0069\u007a\u0065\u003a\u0025\u0064
\u5173\u4e8e=\u0041\u0062\u006f\u0075\u0074
\u8f93\u5165\u6587\u4ef6\u540d\u79f0=\u0045\u006e\u0074\u0065\u0072\u0020\u0074\u0068\u0065\u0020\u0066\u0069\u006c\u0065\u0020\u006e\u0061\u006d\u0065
\u004a\u0061\u0076\u0061\u52a8\u6001\u0043\u006c\u0061\u0073\u0073\u540d\u5b57=\u004a\u0061\u0076\u0061\u0020\u0064\u0079\u006e\u0061\u006d\u0069\u0063\u0020\u0043\u006c\u0061\u0073\u0073\u0020\u006e\u0061\u006d\u0065
\u5237\u65b0\u4ee3\u7406=\u0052\u0065\u0066\u0072\u0065\u0073\u0068\u0020\u0050\u0072\u006f\u0078\u0079
\u57fa\u7840\u4fe1\u606f=\u0042\u0061\u0073\u0065\u0020\u0069\u006e\u0066\u006f\u0072\u006d\u0061\u0074\u0069\u006f\u006e
\u5220\u9664\u5f53\u524d\u7ec4\u4f46\u4e0d\u5220\u9664\u6240\u6709\u6210\u5458=\u0044\u0065\u006c\u0065\u0074\u0065\u0020\u0063\u0075\u0072\u0072\u0065\u006e\u0074\u0020\u0067\u0072\u006f\u0075\u0070\u0020\u0062\u0075\u0074\u0020\u006e\u006f\u0074\u0020\u0061\u006c\u006c\u0020\u006d\u0065\u006d\u0062\u0065\u0072\u0073
\u8bf7\u6c42\u6296\u52a8\u5ef6\u8fdf\u0028\u006d\u0073\u0029=\u0052\u0065\u0071\u0075\u0065\u0073\u0074\u0020\u006a\u0069\u0074\u0074\u0065\u0072\u0020\u0064\u0065\u006c\u0061\u0079\u0020\u0028\u006d\u0073\u0029
\u4fee\u6539\u5931\u8d25=\u004d\u006f\u0064\u0069\u0066\u0069\u0063\u0061\u0074\u0069\u006f\u006e\u0020\u0066\u0061\u0069\u006c\u0075\u0072\u0065
\u5fc3\u8df3\u5305\u5ef6\u8fdf\u0020\u006d\u0073=\u0048\u0065\u0061\u0072\u0074\u0062\u0065\u0061\u0074\u0020\u0070\u0061\u0063\u006b\u0065\u0074\u0020\u0064\u0065\u006c\u0061\u0079\u0020\u006d\u0073
\u7531\u0042\u0065\u0069\u0063\u0068\u0065\u006e\u0044\u0072\u0065\u0061\u006d\u5f3a\u529b\u9a71\u52a8\u005c\u006e\u004d\u0061\u0069\u006c\u003a\u0062\u0065\u0069\u0063\u0068\u0065\u006e\u0064\u0072\u0065\u0061\u006d\u0040\u0067\u006d\u0061\u0069\u006c\u002e\u0063\u006f\u006d=\u0050\u006f\u0077\u0065\u0072\u0066\u0075\u006c\u006c\u0079\u0020\u0064\u0072\u0069\u0076\u0065\u006e\u0020\u0062\u0079\u0020\u0042\u0065\u0069\u0063\u0068\u0065\u006e\u0044\u0072\u0065\u0061\u006d\u0020\u005c\u006e\u004d\u0061\u0069\u006c\u003a\u0062\u0065\u0069\u0063\u0068\u0065\u006e\u0064\u0072\u0065\u0061\u006d\u0040\u0067\u006d\u0061\u0069\u006c\u002e\u0063\u006f\u006d
\u9009\u62e9\u5206\u7ec4=\u0053\u0065\u006c\u0065\u0063\u0074\u0020\u0067\u0072\u006f\u0075\u0070
\u54e5\u65af\u62c9\u0020\u0020\u0020\u0056\u0025\u0073\u0020\u0062\u0079\u003a\u0020\u0042\u0065\u0069\u0063\u0068\u0065\u006e\u0044\u0072\u0065\u0061\u006d\u0020\u0047\u0069\u0074\u0068\u0075\u0062\u003a\u0068\u0074\u0074\u0070\u0073\u003a\u002f\u002f\u0067\u0069\u0074\u0068\u0075\u0062\u002e\u0063\u006f\u006d\u002f\u0042\u0065\u0069\u0063\u0068\u0065\u006e\u0044\u0072\u0065\u0061\u006d\u002f\u0047\u006f\u0064\u007a\u0069\u006c\u006c\u0061=\u0047\u006f\u0064\u007a\u0069\u006c\u006c\u0061\u0020\u0056\u0025\u0073\u0020\u0062\u0079\u003a\u0020\u0042\u0065\u0069\u0063\u0068\u0065\u006e\u0044\u0072\u0065\u0061\u006d\u0020\u0047\u0069\u0074\u0068\u0075\u0062\u003a\u0068\u0074\u0074\u0070\u0073\u003a\u002f\u002f\u0067\u0069\u0074\u0068\u0075\u0062\u002e\u0063\u006f\u006d\u002f\u0042\u0065\u0069\u0063\u0068\u0065\u006e\u0044\u0072\u0065\u0061\u006d\u002f\u0047\u006f\u0064\u007a\u0069\u006c\u006c\u0061
\u6587\u4ef6\u6743\u9650\u003a=\u0046\u0069\u006c\u0065\u0020\u0070\u0065\u0072\u006d\u0069\u0073\u0073\u0069\u006f\u006e\u0073\u003a
\u672a\u627e\u5230\u006c\u006f\u0061\u0064\u0065\u0072=\u004e\u006f\u0020\u006c\u006f\u0061\u0064\u0065\u0072\u0020\u0066\u006f\u0075\u006e\u0064
\u6570\u636e\u5e93\u7c7b\u578b=\u0044\u0061\u0074\u0061\u0062\u0061\u0073\u0065\u0020\u0074\u0079\u0070\u0065
\u76ee\u6807\u6587\u4ef6\u5939=\u0054\u0061\u0072\u0067\u0065\u0074\u0020\u0046\u006f\u006c\u0064\u0065\u0072
\u8bf7\u6c42\u4f53=\u0052\u0065\u0071\u0075\u0065\u0073\u0074\u0020\u0042\u006f\u0064\u0079
\u4fee\u6539\u6210\u529f\u0021\u0020\u91cd\u542f\u7a0b\u5e8f\u751f\u6548\u0021=\u004d\u006f\u0064\u0069\u0066\u0069\u0065\u0064\u0020\u0073\u0075\u0063\u0063\u0065\u0073\u0073\u0066\u0075\u006c\u006c\u0079\u0021\u0020\u0052\u0065\u0073\u0074\u0061\u0072\u0074\u0020\u0074\u0068\u0065\u0020\u0070\u0072\u006f\u0067\u0072\u0061\u006d\u0020\u0074\u006f\u0020\u0074\u0061\u006b\u0065\u0020\u0065\u0066\u0066\u0065\u0063\u0074\u0021
\u9519\u8bef\u91cd\u8bd5\u6700\u5927\u6b21\u6570=\u004d\u0061\u0078\u0069\u006d\u0075\u006d\u0020\u006e\u0075\u006d\u0062\u0065\u0072\u0020\u006f\u0066\u0020\u0065\u0072\u0072\u006f\u0072\u0020\u0072\u0065\u0074\u0072\u0069\u0065\u0073
\u7c98\u8d34=\u0050\u0061\u0073\u0074\u0065
\u8bf7\u6c42\u0043\u006f\u006f\u006b\u0069\u0065\u0073\u0020\u652f\u6301\u0043\u0032\u4fe1\u9053=\u0052\u0065\u0071\u0075\u0065\u0073\u0074\u0020\u0043\u006f\u006f\u006b\u0069\u0065\u0073\u0020\u0053\u0075\u0070\u0070\u006f\u0072\u0074\u0020\u0043\u0032\u0020\u0063\u0068\u0061\u006e\u006e\u0065\u006c\u0073
\u6dfb\u52a0\u5931\u8d25=\u0046\u0061\u0069\u006c\u0065\u0064\u0020\u0074\u006f\u0020\u0061\u0064\u0064
\u534f\u8bae\u5934=\u0050\u0072\u006f\u0074\u006f\u0063\u006f\u006c\u0020\u0068\u0065\u0061\u0064\u0065\u0072
\u5bfc\u51fa\u6210\u529f=\u0045\u0078\u0070\u006f\u0072\u0074\u0020\u0073\u0075\u0063\u0063\u0065\u0073\u0073
\u8bed\u8a00=\u004c\u0061\u006e\u0067\u0075\u0061\u0067\u0065
\u968f\u673a\u0055\u0041=\u0052\u0061\u006e\u0064\u006f\u006d\u0020\u0055\u0041
\u7f16\u7801=\u0045\u006e\u0063\u006f\u0064\u0069\u006e\u0067
\u8bf7\u6c42\u8868\u5355\u53c2\u6570=\u0052\u0065\u0071\u0075\u0065\u0073\u0074\u0020\u0046\u006f\u0072\u006d\u0020\u0050\u0061\u0072\u0061\u006d\u0065\u0074\u0065\u0072\u0073
\u8fdb\u5165\u7f13\u5b58=\u0047\u006f\u0020\u0074\u006f\u0020\u0063\u0061\u0063\u0068\u0065
\u6b63\u5728\u67e5\u627e\u0025\u0073\u89e3\u91ca\u5668=\u004c\u006f\u006f\u006b\u0069\u006e\u0067\u0020\u0066\u006f\u0072\u0020\u0025\u0073\u0020\u0069\u006e\u0074\u0065\u0072\u0070\u0072\u0065\u0074\u0065\u0072
\u901a\u4fe1\u914d\u7f6e=\u0043\u006f\u006d\u006d\u0075\u006e\u0069\u0063\u0061\u0074\u0069\u006f\u006e\u0020\u0063\u006f\u006e\u0066\u0069\u0067\u0075\u0072\u0061\u0074\u0069\u006f\u006e
\u5747\u8861\u0050\u0072\u006f\u0078\u0079\u0020\u5982\u0020\u0068\u0074\u0074\u0070\u003a\u002f\u002f\u0031\u0032\u0037\u002e\u0030\u002e\u0030\u002e\u0031\u003a\u0038\u0030\u0038\u0030\u0020\u0020\u0073\u006f\u0063\u006b\u0073\u0035\u003a\u002f\u002f\u0031\u0032\u0037\u002e\u0030\u002e\u0030\u002e\u0031\u003a\u0031\u0030\u0038\u0038=\u0042\u0061\u006c\u0061\u006e\u0063\u0065\u0064\u0020\u0050\u0072\u006f\u0078\u0079\u0020\u0065\u002e\u0067\u002e\u0020\u0068\u0074\u0074\u0070\u003a\u002f\u002f\u0031\u0032\u0037\u002e\u0030\u002e\u0030\u002e\u0031\u003a\u0038\u0030\u0038\u0030\u0020\u0073\u006f\u0063\u006b\u0073\u0035\u003a\u002f\u002f\u0031\u0032\u0037\u002e\u0030\u002e\u0030\u002e\u0031\u003a\u0031\u0030\u0038\u0038
\u0053\u0065\u0072\u0076\u0065\u0072\u5355\u6b21\u8bfb\u53d6\u5927\u5c0f\u003a=\u0053\u0065\u0072\u0076\u0065\u0072\u0020\u0073\u0069\u006e\u0067\u006c\u0065\u0020\u0072\u0065\u0061\u0064\u0020\u0073\u0069\u007a\u0065\u003a
\u0070\u0061\u0079\u006c\u006f\u0061\u0064\u0020\u6216\u0020\u0020\u0063\u0072\u0079\u0070\u0074\u0069\u006f\u006e\u0020\u6ca1\u6709\u9009\u4e2d\u0021=\u0070\u0061\u0079\u006c\u006f\u0061\u0064\u0020\u006f\u0072\u0020\u0063\u0072\u0079\u0070\u0074\u0069\u006f\u006e\u0020\u006e\u006f\u0074\u0020\u0063\u0068\u0065\u0063\u006b\u0065\u0064\u0021
\u670d\u52a1\u5df2\u5f00\u542f=\u0053\u0065\u0072\u0076\u0069\u0063\u0065\u0020\u0069\u0073\u0020\u006f\u006e
\u79fb\u9664=\u0052\u0065\u006d\u006f\u0076\u0065
\u4e0a\u4f20\u6210\u529f=\u0055\u0070\u006c\u006f\u0061\u0064\u0020\u0073\u0075\u0063\u0063\u0065\u0073\u0073\u0066\u0075\u006c
\u0050\u0065\u0054\u006f\u0053\u0068\u0065\u006c\u006c\u0063\u006f\u0064\u0065\u65f6\u0020\u53d1\u751f\u9519\u8bef\u0021=\u0041\u006e\u0020\u0065\u0072\u0072\u006f\u0072\u0020\u006f\u0063\u0063\u0075\u0072\u0072\u0065\u0064\u0020\u0064\u0075\u0072\u0069\u006e\u0067\u0020\u0050\u0065\u0054\u006f\u0053\u0068\u0065\u006c\u006c\u0063\u006f\u0064\u0065\u0021
\u914d\u7f6e=\u0043\u006f\u006e\u0066\u0069\u0067\u0075\u0072\u0065
\u5bfc\u51fa\u8bc1\u4e66=\u0045\u0078\u0070\u006f\u0072\u0074\u0020\u0063\u0065\u0072\u0074\u0069\u0066\u0069\u0063\u0061\u0074\u0065
\u79fb\u9664\u6240\u6709\u5931\u8d25=\u0052\u0065\u006d\u006f\u0076\u0065\u0020\u0061\u006c\u006c\u0020\u0066\u0061\u0069\u006c\u0075\u0072\u0065\u0073
\u4fdd\u5b58\u5931\u8d25=\u0046\u0061\u0069\u006c\u0065\u0064\u0020\u0074\u006f\u0020\u0073\u0061\u0076\u0065
\u7528\u6237\u53d6\u6d88\u9009\u62e9\u002e\u002e\u002e\u002e\u002e\u002e\u002e=\u0055\u0073\u0065\u0072\u0020\u0064\u0065\u0073\u0065\u006c\u0065\u0063\u0074\u0065\u0064\u0020\u002e\u002e\u002e\u002e\u002e\u002e\u002e
\u0046\u0050\u004d\u002f\u0046\u0043\u0047\u0049\u0020\u5730\u5740=\u0046\u0050\u004d\u002f\u0046\u0043\u0047\u0049\u0020\u0061\u0064\u0064\u0072\u0065\u0073\u0073
\u5927\u6587\u4ef6\u4e0b\u8f7d\u5f00\u59cb\u0020\u6587\u4ef6\u540d\u003a\u0025\u0073=\u0053\u0074\u0061\u0072\u0074\u0020\u006f\u0066\u0020\u006c\u0061\u0072\u0067\u0065\u0020\u0066\u0069\u006c\u0065\u0020\u0064\u006f\u0077\u006e\u006c\u006f\u0061\u0064\u0020\u0046\u0069\u006c\u0065\u006e\u0061\u006d\u0065\u003a\u0025\u0073
\u8bf7\u6c42\u0043\u006f\u006f\u006b\u0069\u0065=\u0052\u0065\u0071\u0075\u0065\u0073\u0074\u0020\u0043\u006f\u006f\u006b\u0069\u0065
\u9009\u9879\u5361\u7a97\u53e3=\u0054\u0061\u0062\u0020\u0077\u0069\u006e\u0064\u006f\u0077
\u626b\u63cf\u7ed3\u675f\u0021\u0021\u0021\u0020\u626b\u63cf\u8017\u65f6\u003a\u0020\u0025\u0064\u006d\u0073=\u0045\u006e\u0064\u0020\u006f\u0066\u0020\u0073\u0063\u0061\u006e\u0021\u0021\u0021\u0020\u0053\u0063\u0061\u006e\u0020\u0074\u0069\u006d\u0065\u003a\u0020\u0025\u0064\u006d\u0073
\u8fdc\u7a0b\u4e0b\u8f7d=\u0052\u0065\u006d\u006f\u0074\u0065\u0020\u0064\u006f\u0077\u006e\u006c\u006f\u0061\u0064
\u5bc6\u7801\u003a=\u0050\u0061\u0073\u0073\u0077\u006f\u0072\u0064\u003a
\u4e0b\u8f7d\u5355\u6b21\u8bfb\u53d6\u5b57\u8282\u003a=\u0044\u006f\u0077\u006e\u006c\u006f\u0061\u0064\u0020\u0073\u0069\u006e\u0067\u006c\u0065\u0020\u0072\u0065\u0061\u0064\u0020\u0062\u0079\u0074\u0065\u003a
\u672a\u77e5\u7684\u0053\u006f\u0063\u006b\u0073\u534f\u8bae\u6807\u5fd7\u0020\u8bfb\u53d6\u957f\u5ea6\u003a\u0025\u0064\u0020\u534f\u8bae\u6807\u5fd7\u003a\u0025\u0064=\u0055\u006e\u006b\u006e\u006f\u0077\u006e\u0020\u0053\u006f\u0063\u006b\u0073\u0020\u0070\u0072\u006f\u0074\u006f\u0063\u006f\u006c\u0020\u0066\u006c\u0061\u0067\u0020\u0052\u0065\u0061\u0064\u0020\u006c\u0065\u006e\u0067\u0074\u0068\u003a\u0025\u0064\u0020\u0050\u0072\u006f\u0074\u006f\u0063\u006f\u006c\u0020\u0066\u006c\u0061\u0067\u003a\u0025\u0064
\u6570\u636e\u5e93\u7aef\u53e3=\u0044\u0061\u0074\u0061\u0062\u0061\u0073\u0065\u0020\u0070\u006f\u0072\u0074
